/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGameContent_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_TELEPORT_HEIGHT_THRESHOLD                          1000.f
#define CONST_TELEPORT_VISIBLE_THRESHOLD                         0.5f

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum SFXGameContent.SFXCustomAction_HenchmanMelee.HenchMeleeStage
/*enum HenchMeleeStage
{
	HM_Attack1                                         = 0,
	HM_Attack2                                         = 1,
	HM_Attack3                                         = 2,
	HM_MAX                                             = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SFXGameContent.SFXVocalizationManagerSP
// 0x0000 (0x02C0 - 0x02C0)
class ASFXVocalizationManagerSP : public ASFXVocalizationManager
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXGRISP
// 0x0003 (0x0380 - 0x037D)
class ASFXGRISP : public ASFXGRI
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXGameInfoSP
// 0x0000 (0x083C - 0x083C)
class ASFXGameInfoSP : public ASFXGame
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool AwardItem ( struct FName ItemName, struct FString Level );
	bool AwardCredits ( int Amount, struct FString Level, unsigned long bShowNotification );
	bool AwardCreditPercent ( float fAmount, struct FString Level, unsigned long bShowNotifications );
	bool AwardXP ( int Amount, struct FString Level, unsigned long bShowNotifications );
	class ANavigationPoint* FindPlayerStart ( class AController* Player, unsigned char InTeam, struct FString IncomingName );
	void eventPostBeginPlay ( );
};

// Class SFXGameContent.SFXSeqAct_DebugImportXP
// 0x0004 (0x00FC - 0x00F8)
class USFXSeqAct_DebugImportXP : public USequenceAction
{
public:
	int                                                StartingLevelID;                                  		// 0x00F8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void Activated ( );
};

// Class SFXGameContent.SFXSeqAct_GiveStartingConsumables
// 0x0000 (0x00F8 - 0x00F8)
class USFXSeqAct_GiveStartingConsumables : public USequenceAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void Activated ( );
};

// Class SFXGameContent.SFXSeqAct_OpenWeaponSelection
// 0x0010 (0x0120 - 0x0110)
class USFXSeqAct_OpenWeaponSelection : public UBioSequenceLatentAction
{
public:
	class UGFxMovieInfo*                               WeaponSelectionMovieInfo;                         		// 0x0110 (0x0008) [0x0000000000000000]              
	int                                                MaxWeapons;                                       		// 0x0118 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      ShowAllWeapons : 1;                               		// 0x011C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIsFinished : 1;                                  		// 0x011C (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool OnMovieClosedDelegate ( class USFXGUIMovie* i_ScreenToClose );
	bool UpdateOp ( float fDeltaT );
	void Activated ( );
};

// Class SFXGameContent.SFXTreasureDataLive
// 0x0000 (0x0080 - 0x0080)
class USFXTreasureDataLive : public USFXTreasureData
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCharacterClass_Content
// 0x0003 (0x0230 - 0x022D)
class USFXCharacterClass_Content : public USFXCharacterClass
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_Revive
// 0x000E (0x014C - 0x013E)
class USFXCustomAction_Revive : public USFXCustomAction_SingleAnim
{
public:
	class ASFXPawn_PlayerParty*                        DownedPlayer;                                     		// 0x0140 (0x0008) [0x0000000000000000]              
	unsigned long                                      bSuccessRevive : 1;                               		// 0x0148 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void Replicate ( );
	void ClientDoCustomAction ( unsigned long bForced );
	void CheckFiring ( );
	void TickCustomAction ( float DeltaTime );
	void StopCustomAction ( );
	void Resurrect ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_Reload
// 0x0018 (0x0128 - 0x0110)
class USFXCustomAction_Reload : public USFXCustomAction_ReloadBase
{
public:
	struct FBodyStance                                 BS_Anim;                                          		// 0x0110 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              fAnimBlendInTime;                                 		// 0x0120 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimBlendOutTime;                                		// 0x0124 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void StartCustomAction ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_ActivateWeaponFlashlight
// 0x000A (0x0148 - 0x013E)
class USFXCustomAction_ActivateWeaponFlashlight : public USFXCustomAction_SingleAnim
{
public:
	class USFXAnimSetCookSpec*                         AnimInfo;                                         		// 0x0140 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_MantleLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_MantleLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Mid_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_CoverSlipLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_CoverSlipLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Mid_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_StdCoverSlipLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_StdCoverSlipLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Std_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_SwatTurnLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_SwatTurnLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Mid_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_StdSwatTurnLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_StdSwatTurnLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Std_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_GapJump
// 0x004B (0x0158 - 0x010D)
class USFXCustomAction_GapJump : public UBioCustomAction
{
public:
	struct FBodyStance                                 BS_Anim;                                          		// 0x0110 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ASFXNav_JumpNode*                            StartPoint;                                       		// 0x0120 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class ASFXNav_JumpNode*                            EndPoint;                                         		// 0x0128 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class ASFXReachSpecPlaceholderCylinder*            BlockingStartCylinder;                            		// 0x0130 (0x0008) [0x0000000000000000]              
	class ASFXReachSpecPlaceholderCylinder*            BlockingEndCylinder;                              		// 0x0138 (0x0008) [0x0000000000000000]              
	float                                              fAnimPlayRate;                                    		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimBlendInTime;                                 		// 0x0144 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimBlendOutTime;                                		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimStartTime;                                   		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimDuration;                                    		// 0x0150 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ERootMotionMode;                                  		// 0x0154 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneX;                                        		// 0x0155 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneY;                                        		// 0x0156 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneZ;                                        		// 0x0157 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool NotifyBump ( class AActor* Other, struct FVector HitNormal );
	void EndThisCustomAction ( );
	void RemoveBlockingEndPoints ( );
	void BlockMoveEndPoints ( );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void StopCustomAction ( );
	void StartAnimation ( );
	void ReachedPrecisePosition ( );
	void AlignmentTimeout ( );
	void StartCustomAction ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_StandingGapJump
// 0x0000 (0x0158 - 0x0158)
class USFXCustomAction_StandingGapJump : public USFXCustomAction_GapJump
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_JumpDown
// 0x0000 (0x01A4 - 0x01A4)
class USFXCustomAction_JumpDown : public USFXCustomAction_BoostDownBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void TickInput ( class UBioPlayerInput* Input, float DeltaTime );
	void PlayStartAnimation ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerMantleOverCover
// 0x0094 (0x05C8 - 0x0534)
class USFXCustomAction_PlayerMantleOverCover : public USFXCustomAction_MantleOverCoverBase
{
public:
	struct FBodyStance                                 BS_CoverStart;                                    		// 0x0534 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_StandingStart;                                 		// 0x0544 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_QuickStandingStart;                            		// 0x0554 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_CoverLoop;                                     		// 0x0564 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_StandingLoop;                                  		// 0x0574 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_QuickStandingLoop;                             		// 0x0584 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_CoverEnd;                                      		// 0x0594 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_StandingEnd;                                   		// 0x05A4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_QuickStandingEnd;                              		// 0x05B4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bStartFromCover : 1;                              		// 0x05C4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bStartFromStorm : 1;                              		// 0x05C4 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void GetEndAnim ( struct FBodyStance* Stance );
	void GetLoopAnim ( struct FBodyStance* Stance );
	void GetStartAnim ( struct FBodyStance* Stance );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void eventTickCustomAction ( float DeltaTime );
	void StopCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_SimpleMoveBase
// 0x0045 (0x0152 - 0x010D)
class USFXCustomAction_SimpleMoveBase : public UBioCustomAction
{
public:
	struct FBodyStance                                 BS_Anim;                                          		// 0x0110 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ASFXReachSpecPlaceholderCylinder*            BlockingStartCylinder;                            		// 0x0120 (0x0008) [0x0000000000000000]              
	class ASFXReachSpecPlaceholderCylinder*            BlockingEndCylinder;                              		// 0x0128 (0x0008) [0x0000000000000000]              
	class UReachSpec*                                  MovementPath;                                     		// 0x0130 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              MoveDistance;                                     		// 0x0138 (0x0004) [0x0000000000000000]              
	float                                              fBlendInTime;                                     		// 0x013C (0x0004) [0x0000000000000000]              
	float                                              fBlendOutTime;                                    		// 0x0140 (0x0004) [0x0000000000000000]              
	unsigned long                                      bAlignPawnBeforeMove : 1;                         		// 0x0144 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned char                                      BlendType;                                        		// 0x0148 (0x0001) [0x0000000000000000]              
	unsigned char                                      RootBoneX;                                        		// 0x0149 (0x0001) [0x0000000000000000]              
	unsigned char                                      RootBoneY;                                        		// 0x014A (0x0001) [0x0000000000000000]              
	unsigned char                                      RootBoneZ;                                        		// 0x014B (0x0001) [0x0000000000000000]              
	unsigned char                                      RMM;                                              		// 0x014C (0x0001) [0x0000000000000000]              
	unsigned char                                      RootRotationPitch;                                		// 0x014D (0x0001) [0x0000000000000000]              
	unsigned char                                      RootRotationYaw;                                  		// 0x014E (0x0001) [0x0000000000000000]              
	unsigned char                                      RootRotationRoll;                                 		// 0x014F (0x0001) [0x0000000000000000]              
	unsigned char                                      RMRM;                                             		// 0x0150 (0x0001) [0x0000000000000000]              
	unsigned char                                      MovePhysics;                                      		// 0x0151 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomAction ( unsigned long bForced );
	void Replicate ( );
	bool CanBeInterrupted ( );
	void DestTimeout ( );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void StopCustomAction ( );
	void PlayStartAnimation ( );
	struct FBodyStance GetBodyStanceAnim ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void RemoveBlockingEndPoints ( );
	void BlockMoveEndPoints ( );
	void eventReachedPrecisePosition ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_PlayerMantleUp
// 0x002E (0x0180 - 0x0152)
class USFXCustomAction_PlayerMantleUp : public USFXCustomAction_SimpleMoveBase
{
public:
	struct FBodyStance                                 BS_MantleUpOutOfCover;                            		// 0x0154 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_MantleUpInCover;                               		// 0x0164 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ACoverSlotMarker*                            StartingSlot;                                     		// 0x0174 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bStartInCover : 1;                                		// 0x017C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomAction ( unsigned long bForced );
	void ServerStartCustomAction ( int NewAction, class ABioPawn* Sync, int NewPowerAction );
	void Replicate ( );
	struct FBodyStance GetBodyStanceAnim ( );
	void StopCustomAction ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipLeft
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipLeft : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipLeftStanding
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipLeftStanding : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipRight
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipRight : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipRightStanding
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipRightStanding : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerLadderClimbUp
// 0x0034 (0x01EC - 0x01B8)
class USFXCustomAction_PlayerLadderClimbUp : public USFXCustomAction_ClimbUpBase
{
public:
	struct FBodyStance                                 BS_CloseLadderEnter;                              		// 0x01B8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBodyStance                                 BS_FarLadderEnter;                                		// 0x01C8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UAnimSet*                                    LadderAnimSet;                                    		// 0x01D8 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              DecayRate;                                        		// 0x01E0 (0x0004) [0x0000000000000000]              
	float                                              CloseEnterDistance;                               		// 0x01E4 (0x0004) [0x0000000000000000]              
	float                                              JumpStartDistance;                                		// 0x01E8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void PreAlignPawnLocation ( );
	void SetMoveStage ( unsigned char NextStage );
	void TickCustomAction ( float DeltaTime );
	void SyncRotation ( float Alpha );
	void SyncJumpEntrance ( float Alpha );
	void TickAlignment ( float DeltaTime );
	void StartCustomAction ( );
	void TickInput ( class UBioPlayerInput* Input, float DeltaTime );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_PlayerLadderClimbDown
// 0x0000 (0x01B0 - 0x01B0)
class USFXCustomAction_PlayerLadderClimbDown : public USFXCustomAction_LadderClimbDownBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void TickInput ( class UBioPlayerInput* Input, float DeltaTime );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeLeft
// 0x0004 (0x0144 - 0x0140)
class USFXCustomAction_PlayerEvadeLeft : public USFXCustomAction_PlayerEvadeBase
{
public:
	float                                              MoveDist;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void RollOverride ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeRight
// 0x0004 (0x0144 - 0x0140)
class USFXCustomAction_PlayerEvadeRight : public USFXCustomAction_PlayerEvadeBase
{
public:
	float                                              MoveDist;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void RollOverride ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeForward
// 0x0014 (0x0154 - 0x0140)
class USFXCustomAction_PlayerEvadeForward : public USFXCustomAction_PlayerEvadeBase
{
public:
	struct FVector                                     MoveOffset;                                       		// 0x0140 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              MoveDist;                                         		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bHitWallEnabled : 1;                              		// 0x0150 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void RollOverride ( );
	void StopCustomAction ( );
	void TurnOnHitWall ( );
	bool NotifyHitWall ( struct FVector HitNormal, class AActor* Wall );
	void EndThisCustomAction ( );
	void SyncRotation ( float Alpha, struct FVector ToEnd2D );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeBackwards
// 0x0004 (0x0144 - 0x0140)
class USFXCustomAction_PlayerEvadeBackwards : public USFXCustomAction_PlayerEvadeBase
{
public:
	float                                              MoveDist;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void RollOverride ( );
	void StopCustomAction ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_MantleMelee
// 0x0010 (0x0260 - 0x0250)
class USFXCustomAction_MantleMelee : public USFXCustomAction_PlayerMeleeBase
{
public:
	struct TArray<class AActor*>                       HitActors;                                        		// 0x0250 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void Breakout ( );
	bool NotifyBump ( class AActor* Other, struct FVector HitNormal );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void StopCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_SyncCoverGrab
// 0x0067 (0x020C - 0x01A5)
class USFXCustomAction_SyncCoverGrab : public USFXCustomAction_ClassMelee
{
public:
	struct FBodyStance                                 BS_AttackerMirror;                                		// 0x01A8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBodyStance                                 BS_VictimMirror;                                  		// 0x01B8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBasedPosition                              VictimLocation;                                   		// 0x01C8 (0x0038) [0x0000000000000000]              
	class ASFXReachSpecPlaceholderCylinder*            PlaceholderCylinder;                              		// 0x0200 (0x0008) [0x0000000000000000]              
	unsigned long                                      bMirroredAttack : 1;                              		// 0x0208 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void NonSyncedAction ( );
	void SyncAttack ( );
	void GetVictimAnim ( struct FBodyStance* Stance );
	void GetAttackerAnim ( struct FBodyStance* Stance );
	class ABioPawn* GetVictimPawn ( );
	void StartCustomAction ( );
	bool ShouldPlayMirrorAnim ( );
	bool VerifyVictimDestIsClear ( class ABioPawn* VictimPawn, struct FVector DestinationPos );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void StartMeleeAttack ( );
};

// Class SFXGameContent.SFXCustomAction_SyncCoverMelee
// 0x0010 (0x0260 - 0x0250)
class USFXCustomAction_SyncCoverMelee : public USFXCustomAction_PlayerMeleeBase
{
public:
	struct FBodyStance                                 BS_AnimPistol;                                    		// 0x0250 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void MeleeImpact ( );
	void StopCustomAction ( );
	void EndThisCustomAction ( );
	void StartCustomAction ( );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_CoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_CoverMeleeRight : public USFXCustomAction_PlayerMeleeBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	class ABioPawn* GetVictimPawn ( );
	void GetMeleeImpactParameters ( struct FAreaEffectParameters* ImpactParams );
	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_CoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_CoverMeleeLeft : public USFXCustomAction_CoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_StdCoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_StdCoverMeleeLeft : public USFXCustomAction_CoverMeleeLeft
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_StdCoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_StdCoverMeleeRight : public USFXCustomAction_CoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_HvyCoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyCoverMeleeRight : public USFXCustomAction_PlayerMeleeBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	class ABioPawn* GetVictimPawn ( );
	void GetMeleeImpactParameters ( struct FAreaEffectParameters* ImpactParams );
	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_HvyCoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyCoverMeleeLeft : public USFXCustomAction_HvyCoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_HvyStdCoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyStdCoverMeleeLeft : public USFXCustomAction_HvyCoverMeleeLeft
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_HvyStdCoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyStdCoverMeleeRight : public USFXCustomAction_HvyCoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_RifleMeleeOne
// 0x0004 (0x0254 - 0x0250)
class USFXCustomAction_RifleMeleeOne : public USFXCustomAction_PlayerMeleeBase
{
public:
	float                                              BladeImpactScale;                                 		// 0x0250 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopMove ( );
	bool OnActorImpacted ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void StopCustomAction ( );
	void EndAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoRifleMeleeTwo ( );
	void RifleMeleeSecondary ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_RifleMeleeTwo
// 0x0000 (0x0254 - 0x0254)
class USFXCustomAction_RifleMeleeTwo : public USFXCustomAction_RifleMeleeOne
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoRifleMeleeThree ( );
	void RifleMeleeThird ( );
};

// Class SFXGameContent.SFXCustomAction_RifleMeleeThree
// 0x0000 (0x0254 - 0x0254)
class USFXCustomAction_RifleMeleeThree : public USFXCustomAction_RifleMeleeTwo
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void RifleMeleeThird ( );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
};

// Class SFXGameContent.SFXCustomAction_PistolMeleeOne
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_PistolMeleeOne : public USFXCustomAction_PlayerMeleeBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopMove ( );
	bool OnActorImpacted ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void StopCustomAction ( );
	void EndAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoPistolMeleeTwo ( );
	void PistolMeleeSecondary ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PistolMeleeTwo
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_PistolMeleeTwo : public USFXCustomAction_PistolMeleeOne
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoPistolMeleeThree ( );
	void PistolMeleeThird ( );
};

// Class SFXGameContent.SFXCustomAction_PistolMeleeThree
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_PistolMeleeThree : public USFXCustomAction_PistolMeleeTwo
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void PistolMeleeThird ( );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpact
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpact : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpactForward
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpactForward : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpactLeft
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpactLeft : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpactRight
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpactRight : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerMeleed
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerMeleed : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpactForward
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpactForward : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_MeleedLeft
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_MeleedLeft : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_MeleedRight
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_MeleedRight : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpact
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpact : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpactLeft
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpactLeft : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpactRight
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpactRight : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_MeleedForward
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_MeleedForward : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_FlinchBase
// 0x00CC (0x020A - 0x013E)
class USFXCustomAction_FlinchBase : public USFXCustomAction_SingleAnim
{
public:
	struct FBodyStance                                 BS_Reaction;                                      		// 0x0140 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAlt;                                   		// 0x0150 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionMidRight;                              		// 0x0160 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltMidRight;                           		// 0x0170 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionMidLeft;                               		// 0x0180 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltMidLeft;                            		// 0x0190 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionStdRight;                              		// 0x01A0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltStdRight;                           		// 0x01B0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionStdLeft;                               		// 0x01C0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltStdLeft;                            		// 0x01D0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAnimSet*                                    AnimSet;                                          		// 0x01E0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallSoundPlayer;                             		// 0x01E8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallImpactSoundPlayer;                       		// 0x01F0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallSoundHench;                              		// 0x01F8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallImpactSoundHench;                        		// 0x0200 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CoverType;                                        		// 0x0208 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CoverAction;                                      		// 0x0209 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void PlayImpactSound ( );
	void PlayWhizSound ( );
	void FlinchActionOverride ( );
	void StopCustomAction ( );
	void StartCustomAction ( );
	struct FBodyStance GetBodyStanceAnim ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void eventGetUsedAnimNames ( struct TArray<struct FName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_FlinchLight
// 0x0002 (0x020C - 0x020A)
class USFXCustomAction_FlinchLight : public USFXCustomAction_FlinchBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_FlinchHeavy
// 0x0002 (0x020C - 0x020A)
class USFXCustomAction_FlinchHeavy : public USFXCustomAction_FlinchBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerOnFire
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerOnFire : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCharacterClass_Vanguard
// 0x0000 (0x0230 - 0x0230)
class USFXCharacterClass_Vanguard : public USFXCharacterClass_Content
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXPowerCustomAction_AmmoPower
// 0x0088 (0x084C - 0x07C4)
class USFXPowerCustomAction_AmmoPower : public USFXPowerCustomAction_AmmoPowerBase
{
public:
	class UClass*                                      WeaponPowerEffectClass;                           		// 0x07C4 (0x0008) [0x0000000000000000]              
	class UClass*                                      ConcussiveShotDamageType;                         		// 0x07CC (0x0008) [0x0000000000000000]              
	struct FGuid                                       OmniToolGuid;                                     		// 0x07D4 (0x0010) [0x0000000000000000]              
	class UStaticMesh*                                 oTracer;                                          		// 0x07E4 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             oImpactVFX;                                       		// 0x07EC (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             oMuzzleVFX;                                       		// 0x07F4 (0x0008) [0x0000000000000000]              
	class UParticleSystem*                             oMuzzleLoopVFX;                                   		// 0x07FC (0x0008) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_ConcussiveShotImpact;                          		// 0x0804 (0x0008) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_ConcussiveShotProjectile;                      		// 0x080C (0x0008) [0x0000000000000000]              
	class UWwiseEvent*                                 ConcussiveShotImpactSound;                        		// 0x0814 (0x0008) [0x0000000000000000]              
	class UWwiseEvent*                                 LoadAmmoPowerSound;                               		// 0x081C (0x0008) [0x0000000000000000]              
	class UWwiseEvent*                                 HenchmanLoadAmmoPowerSound;                       		// 0x0824 (0x0008) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_OmniTool;                                      		// 0x082C (0x0008) [0x0000000000000000]              
	class ABioPawn*                                    DelayedSetWeaponPowerTarget;                      		// 0x0834 (0x0008) [0x1000000000000000]              
	float                                              SquadEffectiveness;                               		// 0x083C (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_HeavyWeaponEquipped;               		// 0x0840 (0x0004) [0x0000000000000000]              
	float                                              OmniToolDuration;                                 		// 0x0844 (0x0004) [0x0000000000000000]              
	unsigned long                                      bModifyTracer : 1;                                		// 0x0848 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bModifyImpactVFX : 1;                             		// 0x0848 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bModifyMuzzle : 1;                                		// 0x0848 (0x0004) [0x0000000000000000] [0x00000004] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void DelayedSetWeaponPower ( );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void DoJoinInProgress ( );
	void SetupEffect ( class USFXGameEffect_AmmoPower* Effect, class ABioPawn* oPawn );
	void OnPowerRankIncreased ( );
	bool ShouldUsePower ( class AActor* Target, struct FString* sOptionalInfo );
	void DoConcussiveShotSpecialImpact ( class AActor* oImpacted, float ImpactEffectDuration );
	void ClientDoPowerSubsequentImpact ( class AActor* oActor, int CustomActionReactionType, float Duration, int ImpactCount, float Delay, unsigned long DoCallback );
	void ReplicateConcussiveShotSpecialImpact ( class ABioPawn* oImpacted, float DurationOfEffect );
	void ConcussiveShotCustomImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ApplyPowerEffects ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon );
	bool SetWeaponPower ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon, unsigned long bOverrideCurrentPower );
	void DeferedSetWeaponPower ( );
	bool OnImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ReloadAmmoPower ( class ABioPawn* Target, class ASFXWeapon* Weapon );
	void StopOmniTool ( );
	void StartCustomAction ( );
	bool CanUsePower ( class AActor* oTarget );
	void PrecacheVFX ( class ASFXObjectPool* ObjectPool, class URvrClientEffectManager* ClientEffects );
};

// Class SFXGameContent.SFXPowerCustomAction_CryoAmmo
// 0x00C4 (0x0910 - 0x084C)
class USFXPowerCustomAction_CryoAmmo : public USFXPowerCustomAction_AmmoPower
{
public:
	struct FPowerData                                  SpeedReduction;                                   		// 0x084C (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  ArmorWeakness;                                    		// 0x0880 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  FreezeChance;                                     		// 0x08B4 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class URvrClientEffectInterface*                   CE_HalfFrozenTemplate;                            		// 0x08E8 (0x0008) [0x0000000000000000]              
	float                                              Evolve_FreezeChanceBonus;                         		// 0x08F0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_FreezeDurationBonus;                       		// 0x08F4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_AmmoIncrease;                              		// 0x08F8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_HeadShotBonus;                             		// 0x08FC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_FrozenDamageBonus;                         		// 0x0900 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_SpeedReductionBonus;                       		// 0x0904 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              Evolve_ArmorWeaknessBonus;                        		// 0x0908 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              SpeedReductionDurationMult;                       		// 0x090C (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void PopulatePowerStatBarEvolves ( );
	void RecalculateAllPowerData ( unsigned long bReset );
	void ResetPower ( );
	void EvolvePower ( unsigned char choice );
	void DoConcussiveShotSpecialImpact ( class AActor* oImpacted, float ImpactEffectDuration );
	void ConcussiveShotCustomImpact ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector HitLocation, struct FVector HitNormal );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector HitLocation, struct FVector HitNormal, int CustomActionReactionType );
	void SetupEffect ( class USFXGameEffect_AmmoPower* Effect, class ABioPawn* oPawn );
	void ApplyPowerEffects ( class ABioPawn* oPawn, class ASFXWeapon* oWeapon );
};

// Class SFXGameContent.SFXPowerCustomAction_Shockwave
// 0x018B (0x094C - 0x07C1)
class USFXPowerCustomAction_Shockwave : public USFXPowerCustomAction
{
public:
	struct FPowerData                                  NumShockwaveImpacts;                              		// 0x07C4 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  GravityLevel;                                     		// 0x07F8 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
