/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SFXGame.Bio2DA.Bio2DACellData
// 0x000C
struct FBio2DACellData
{
	unsigned char                                      nDataType_NATIVE_MIRROR;                          		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FPointer                                    nData_NATIVE_MIRROR;                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.Bio2DA.Bio2daMasterRowIndexRec
// 0x000C
struct FBio2daMasterRowIndexRec
{
	class UBio2DA*                                     pTable;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                nRowIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAiController.EnemyInfo
// 0x0048
struct FEnemyInfo
{
	struct FVector                                     KnownLocation;                                    		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     InterpLocation;                                   		// 0x000C (0x000C) [0x0000000000000000]              
	struct FCoverInfo                                  Cover;                                            		// 0x0018 (0x000C) [0x0000000000000000]              
	class APawn*                                       Pawn;                                             		// 0x0024 (0x0008) [0x0000000000000000]              
	float                                              InterpTime;                                       		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              InitialSeenTime;                                  		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              LastSeenTime;                                     		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              LastFailedPathTime;                               		// 0x0038 (0x0004) [0x0000000000000000]              
	float                                              LastKnownLocUpdateTime;                           		// 0x003C (0x0004) [0x0000000000000000]              
	float                                              LastHurtByTime;                                   		// 0x0040 (0x0004) [0x0000000000000000]              
	unsigned long                                      bVisible : 1;                                     		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAiController.DelayUpdateInfo
// 0x0015
struct FDelayUpdateInfo
{
	class AController*                                 Controller;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       EventName;                                        		// 0x0008 (0x0008) [0x0000000000000000]              
	float                                              UpdateTime;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0014 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimCheckBlendOut.BioAnimCheckBlendOutNode
// 0x000C
struct FBioAnimCheckBlendOutNode
{
	class UAnimNodeBlendList*                          Node;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Index;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimCheckBlendOut.BioAnimCheckBlendOutPath
// 0x0018
struct FBioAnimCheckBlendOutPath
{
	struct TArray<struct FBioAnimCheckBlendOutNode>    Nodes;                                            		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FPointer                                    Next;                                             		// 0x0010 (0x0008) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioAnimMovementSync.BioAnimMovementSyncNode
// 0x0010
struct FBioAnimMovementSyncNode
{
	class UAnimNode*                                   Node;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	class UAnimNode*                                   NodeWeight;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlend_TurnInPlace.RotTransitionInfo
// 0x0008
struct FRotTransitionInfo
{
	float                                              RotationOffset;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ChildIndex;                                       		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAction.BlendTimeTo
// 0x0005
struct FBlendTimeTo
{
	float                                              m_fTime;                                          		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eAnimNode;                                      		// 0x0004 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAction.BlendTimeFrom
// 0x0059
struct FBlendTimeFrom
{
	struct FBlendTimeTo                                m_aBlendTimeTo[ 0xB ];                            		// 0x0000 (0x0058) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      m_eAnimNode;                                      		// 0x0058 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
};

// ScriptStruct SFXGame.BioAnimNodeBlendByAim.BioAnimNodeBlendByAimLimits
// 0x0010
struct FBioAnimNodeBlendByAimLimits
{
	float                                              DegreesLeft;                                      		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesRight;                                     		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesUp;                                        		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DegreesDown;                                      		// 0x000C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct SFXGame.BioAnimNodeBlendMultiAdditive.BioChildActivateData
// 0x0010
struct FBioChildActivateData
{
	float                                              fFinalWeight;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fRemainingTime;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              fTotalBlendTime;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      bApplyData : 1;                                   		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendPoseAndGestures.BioChildPinData
// 0x0020
struct FBioChildPinData
{
	struct TArray<class UBioGestChainTree*>            aChainedTrees;                                    		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              fEndBlendStartTime;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fEndTime;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bPlayUntilNext : 1;                               		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseDynAnimSets : 1;                              		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendPoseAndGestures.BioEndBlendData
// 0x0008
struct FBioEndBlendData
{
	float                                              fEndBlendStartTime;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fEndBlendDuration;                                		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalar.BioScalarBlendParams
// 0x000C
struct FBioScalarBlendParams
{
	float                                              Min;                                              		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Peak;                                             		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Max;                                              		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalar.BioScalarPrecomputedValues
// 0x0008
struct FBioScalarPrecomputedValues
{
	float                                              fRangeLowerRatio;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fRangeUpperRatio;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalarBehavior.BioAnimScalarNodeChildDef
// 0x0014
struct FBioAnimScalarNodeChildDef
{
	struct FBioScalarBlendParams                       BlendParams;                                      		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FName                                       Name;                                             		// 0x000C (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendScalarBehavior.BioAnimScalarNodeBehaviorDef
// 0x002C
struct FBioAnimScalarNodeBehaviorDef
{
	struct TArray<struct FBioAnimScalarNodeChildDef>   Children;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              BlendPctPerSecond;                                		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              DefaultScalar;                                    		// 0x0024 (0x0004) [0x0000000000000000]              
	unsigned long                                      BlendInstant : 1;                                 		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioAnimNodeBlendState.BioAnimBlendParams
// 0x0011
struct FBioAnimBlendParams
{
	struct TArray<float>                               BlendToChildTimes;                                		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned char                                      PlayMode;                                         		// 0x0010 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioAnimNodeBlendStateBehavior.BioAnimStateNodeChildDef
// 0x0020
struct FBioAnimStateNodeChildDef
{
	struct FBioAnimBlendParams                         BlendParams;                                      		// 0x0000 (0x0014) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       Name;                                             		// 0x0014 (0x0008) [0x0000000000000000]              
	float                                              DefaultWeight;                                    		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioAnimNodeBlendStateBehavior.BioAnimStateNodeBehaviorDef
// 0x0010
struct FBioAnimStateNodeBehaviorDef
{
	struct TArray<struct FBioAnimStateNodeChildDef>    Children;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioAnimNodeSequenceByBoneRotation.AnimByRotation
// 0x001C
struct FAnimByRotation
{
	struct FRotator                                    DesiredRotation;                                  		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AnimName;                                         		// 0x000C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UAnimSequence*                               AnimSeq;                                          		// 0x0014 (0x0008) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
};

// ScriptStruct SFXGame.BioDefine.EnemyWaveInfo
// 0x0014
struct FEnemyWaveInfo
{
	struct FName                                       EnemyType;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                MinCount;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                MaxCount;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                MaxPerWave;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.ScarInfo
// 0x0078
struct FScarInfo
{
	struct FVector2D                                   Threshold;                                        		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     Emissive;                                         		// 0x0008 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Normal;                                           		// 0x0018 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     EyeEmissive;                                      		// 0x0028 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleEmissive;                                   		// 0x0038 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleNormal;                                     		// 0x0048 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleEyeEmissive;                                		// 0x0058 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FLinearColor                                Color;                                            		// 0x0068 (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PowerEvolveStatDetails
// 0x0028
struct FPowerEvolveStatDetails
{
	struct FString                                     Title;                                            		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     TotalTitle;                                       		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Pct;                                              		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                BonusPct;                                         		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.ASParams
// 0x001D
struct FASParams
{
	struct FString                                     sVar;                                             		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nVar;                                             		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              fVar;                                             		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bVar : 1;                                         		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      Type;                                             		// 0x001C (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioMessageBoxOptionalParams
// 0x0017
struct FBioMessageBoxOptionalParams
{
	int                                                srKBMText;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                srAText;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                srBText;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                nIconIndex;                                       		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bNoFade : 1;                                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bModal : 1;                                       		// 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bForcePlayersOnly : 1;                            		// 0x0010 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned char                                      nIconSet;                                         		// 0x0014 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_SkinType;                                       		// 0x0015 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_TextAlign;                                      		// 0x0016 (0x0001) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioMessageBoxData
// 0x0050
struct FBioMessageBoxData
{
	struct FString                                     m_sMessage;                                       		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FBioMessageBoxOptionalParams                m_stParams;                                       		// 0x0010 (0x0018) [0x0000000000000000]              
	struct FName                                       m_nmName;                                         		// 0x0028 (0x0008) [0x0000000000000000]              
	class UObject*                                     m_pCallbackObject;                                		// 0x0030 (0x0008) [0x0000000000000000]              
	struct FName                                       m_nmCallbackFunction;                             		// 0x0038 (0x0008) [0x0000000000000000]              
	int                                                m_nPriority;                                      		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                m_nContext;                                       		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                m_nControllerId;                                  		// 0x0048 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bPersistThroughTravel : 1;                      		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bWasGamePaused : 1;                             		// 0x004C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bIsWeaponChoiceDlg : 1;                         		// 0x004C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct SFXGame.BioDefine.HenchmanInfoStruct
// 0x0038
struct FHenchmanInfoStruct
{
	struct FName                                       className;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FName                                       Tag;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
	int                                                PrettyName;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                AlternatePrettyName;                              		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FName                                       AlternateHenchNamePlotFlag;                       		// 0x0018 (0x0008) [0x0000000000000000]              
	int                                                HenchAcquiredPlotID;                              		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                HenchInSquadPlotID;                               		// 0x0024 (0x0004) [0x0000000000000000]              
	struct FString                                     HenchmanImage;                                    		// 0x0028 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.BioVersionedNativeObject
// 0x0004
struct FBioVersionedNativeObject
{
	int                                                nInstanceVersion;                                 		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioDiscoveredCodexPage
// 0x0010(0x0014 - 0x0004)
struct FBioDiscoveredCodexPage : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nPage;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bNew : 1;                                         		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioDiscoveredCodex
// 0x0018(0x001C - 0x0004)
struct FBioDiscoveredCodex : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FBioDiscoveredCodexPage>      lstDiscoveredPages;                               		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.BioCodexEntry
// 0x0020(0x0024 - 0x0004)
struct FBioCodexEntry : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	class UWwiseEvent*                                 CodexSound;                                       		// 0x000C (0x0008) [0x0000000000000000]              
	int                                                srTitle;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                srDescription;                                    		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nTextureIndex;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nPriority;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioCodexSection
// 0x000C(0x0030 - 0x0024)
struct FBioCodexSection : FBioCodexEntry
{
	struct FPointer                                    VfTable;                                          		// 0x0024 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bPrimary : 1;                                     		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioTaskEval
// 0x0018(0x001C - 0x0004)
struct FBioTaskEval : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nQuest;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nTask;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nConditional;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nState;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioStateTaskList
// 0x0018(0x001C - 0x0004)
struct FBioStateTaskList : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FBioTaskEval>                 lstTaskEvals;                                     		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFXGame.BioDefine.BioCodexPage
// 0x000C(0x0030 - 0x0024)
struct FBioCodexPage : FBioCodexEntry
{
	struct FPointer                                    VfTable;                                          		// 0x0024 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nSection;                                         		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioQuestGoal
// 0x0018(0x001C - 0x0004)
struct FBioQuestGoal : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                srName;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                srDescription;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nConditional;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nState;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioQuestTask
// 0x003C(0x0040 - 0x0004)
struct FBioQuestTask : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<int>                                 lstPlotItemIndices;                               		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     sWaypointTag;                                     		// 0x001C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FName                                       nmPlanet;                                         		// 0x002C (0x0008) [0x0000000000100000]              
	int                                                srName;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                srDescription;                                    		// 0x0038 (0x0004) [0x0000000000000000]              
	unsigned long                                      bQuestCompleteTask : 1;                           		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioPlotItem
// 0x001C(0x0020 - 0x0004)
struct FBioPlotItem : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                srName;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                nIconIndex;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                nConditional;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nState;                                           		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                nTargetItems;                                     		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioQuest
// 0x003C(0x0040 - 0x0004)
struct FBioQuest : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FBioQuestGoal>                lstGoals;                                         		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct TArray<struct FBioQuestTask>                lstTasks;                                         		// 0x001C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct TArray<struct FBioPlotItem>                 lstPlotItems;                                     		// 0x002C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned long                                      bMission : 1;                                     		// 0x003C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioQuestProgress
// 0x0024(0x0028 - 0x0004)
struct FBioQuestProgress : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<int>                                 lstTaskHistory;                                   		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nQuestAdded;                                      		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                nActiveGoal;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
	unsigned long                                      bQuestUpdated : 1;                                		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioStateEventElement
// 0x0008(0x000C - 0x0004)
struct FBioStateEventElement : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
};

// ScriptStruct SFXGame.BioDefine.BioSEESubstate
// 0x0024(0x0030 - 0x000C)
struct FBioSEESubstate : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<int>                                 lstSiblingIndices;                                		// 0x0014 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                nGlobalBool;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                nParentIndex;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNewState : 1;                                    		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseParam : 1;                                    		// 0x002C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bParentTypeOr : 1;                                		// 0x002C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct SFXGame.BioDefine.BioSEELocal
// 0x0020(0x002C - 0x000C)
struct FBioSEELocal : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct FName                                       ObjectTag;                                        		// 0x0014 (0x0008) [0x0000000000100000]              
	struct FName                                       FunctionName;                                     		// 0x001C (0x0008) [0x0000000000100000]              
	int                                                nObjectType;                                      		// 0x0024 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUseParam : 1;                                    		// 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioSEELocalInt
// 0x000C(0x0038 - 0x002C)
struct FBioSEELocalInt : FBioSEELocal
{
	struct FPointer                                    VfTable;                                          		// 0x002C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nNewValue;                                        		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEEInt
// 0x0014(0x0020 - 0x000C)
struct FBioSEEInt : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nGlobalInt;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                nNewValue;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUseParam : 1;                                    		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIncrement : 1;                                   		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioDefine.BioSEELocalFloat
// 0x000C(0x0038 - 0x002C)
struct FBioSEELocalFloat : FBioSEELocal
{
	struct FPointer                                    VfTable;                                          		// 0x002C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	float                                              fNewValue;                                        		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEELocalBool
// 0x000C(0x0038 - 0x002C)
struct FBioSEELocalBool : FBioSEELocal
{
	struct FPointer                                    VfTable;                                          		// 0x002C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	unsigned long                                      bNewValue : 1;                                    		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFXGame.BioDefine.BioSEEFunction
// 0x0024(0x0030 - 0x000C)
struct FBioSEEFunction : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct FName                                       FunctionPackage;                                  		// 0x0014 (0x0008) [0x0000000000100000]              
	struct FName                                       FunctionClass;                                    		// 0x001C (0x0008) [0x0000000000100000]              
	struct FName                                       FunctionName;                                     		// 0x0024 (0x0008) [0x0000000000100000]              
	int                                                nParameter;                                       		// 0x002C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEEFloat
// 0x0014(0x0020 - 0x000C)
struct FBioSEEFloat : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nGlobalFloat;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              fNewValue;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUseParam : 1;                                    		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIncrement : 1;                                   		// 0x001C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioDefine.BioSEEConsequence
// 0x000C(0x0018 - 0x000C)
struct FBioSEEConsequence : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nConsequence;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.BioDefine.BioSEEBool
// 0x0010(0x001C - 0x000C)
struct FBioSEEBool : FBioStateEventElement
{
	struct FPointer                                    VfTable;                                          		// 0x000C (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	int                                                nGlobalBool;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNewState : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseParam : 1;                                    		// 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct SFXGame.BioDefine.BioStateEvent
// 0x0018(0x001C - 0x0004)
struct FBioStateEvent : FBioVersionedNativeObject
{
	struct FPointer                                    VfTable;                                          		// 0x0004 (0x0008) [0x0000000000803002]              ( CPF_Const | CPF_Native | CPF_Transient | CPF_NoExport )
	struct TArray<struct FPointer>                     lstEventElements;                                 		// 0x000C (0x0010) [0x0000000000101000]              ( CPF_Native )
};

// ScriptStruct SFXGame.BioDefine.PlayerMeshInfo
// 0x0084
struct FPlayerMeshInfo
{
	struct FString                                     Male;                                             		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleVisor;                                        		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleFaceplate;                                    		// 0x0020 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     MaleMaterialOverride;                             		// 0x0030 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     Female;                                           		// 0x0040 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleVisor;                                      		// 0x0050 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleFaceplate;                                  		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     FemaleMaterialOverride;                           		// 0x0070 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bHasBreather : 1;                                 		// 0x0080 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bHideHead : 1;                                    		// 0x0080 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bHideHair : 1;                                    		// 0x0080 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerPatternInfo
// 0x0078
struct FPlayerPatternInfo
{
	struct FVectorParameterValue                       Stripe1Param;                                     		// 0x0000 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       Stripe2Param;                                     		// 0x0028 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       Stripe3Param;                                     		// 0x0050 (0x0028) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerSpecInfo
// 0x0054
struct FPlayerSpecInfo
{
	struct FScalarParameterValue                       SpecParam;                                        		// 0x0000 (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FScalarParameterValue                       SpecPwrParam;                                     		// 0x001C (0x001C) [0x0000000000000001]              ( CPF_Edit )
	struct FScalarParameterValue                       EnvMapParam;                                      		// 0x0038 (0x001C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerTintInfo
// 0x0050
struct FPlayerTintInfo
{
	struct FVectorParameterValue                       TintParam;                                        		// 0x0000 (0x0028) [0x0000000000000001]              ( CPF_Edit )
	struct FVectorParameterValue                       PhongParam;                                       		// 0x0028 (0x0028) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.CustomizableElement
// 0x01C5
struct FCustomizableElement
{
	struct FPlayerMeshInfo                             Mesh;                                             		// 0x0000 (0x0084) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FString>                      GameEffects;                                      		// 0x0084 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FPlayerPatternInfo                          Pattern;                                          		// 0x0094 (0x0078) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerSpecInfo                             Spec;                                             		// 0x010C (0x0054) [0x0000000000000001]              ( CPF_Edit )
	struct FPlayerTintInfo                             Tint;                                             		// 0x0160 (0x0050) [0x0000000000000001]              ( CPF_Edit )
	int                                                Id;                                               		// 0x01B0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Name;                                             		// 0x01B4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Description;                                      		// 0x01B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PlotFlag;                                         		// 0x01BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bCustomizable : 1;                                		// 0x01C0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      Type;                                             		// 0x01C4 (0x0001) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerEmissiveColorValue
// 0x001C
struct FPlayerEmissiveColorValue
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor3Value
// 0x001C
struct FPlayerCustomColor3Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor2Value
// 0x001C
struct FPlayerCustomColor2Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomColor1Value
// 0x0034
struct FPlayerCustomColor1Value
{
	struct FLinearColor                                ParameterValue;                                   		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                PhongParameterValue;                              		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ParameterName;                                    		// 0x0020 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       PhongParameterName;                               		// 0x0028 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternColorValue
// 0x004C
struct FPlayerCustomPatternColorValue
{
	struct FLinearColor                                Stripe1ColorValue;                                		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ColorValue;                                		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ColorValue;                                		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe1ColorName;                                 		// 0x0030 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ColorName;                                 		// 0x0038 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ColorName;                                 		// 0x0040 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                ColorName;                                        		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioDefine.PlayerCustomPatternValue
// 0x004C
struct FPlayerCustomPatternValue
{
	struct FLinearColor                                Stripe1ParameterValue;                            		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe2ParameterValue;                            		// 0x0010 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                Stripe3ParameterValue;                            		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe1ParameterName;                             		// 0x0030 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe2ParameterName;                             		// 0x0038 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       Stripe3ParameterName;                             		// 0x0040 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                PatternName;                                      		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFXGame.BioCameraBehaviorGalaxy.SFXGalaxyMapSelector
// 0x0030
struct FSFXGalaxyMapSelector
{
	struct TArray<int>                                 m_PlotNames;                                      		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class USFXGalaxyMapObject*                         m_GalaxyMapObject;                                		// 0x0010 (0x0008) [0x0000000000000000]              
	class AActor*                                      m_actor;                                          		// 0x0018 (0x0008) [0x0000000000000000]              
	int                                                m_Name;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                m_nPctExplored;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                m_State;                                          		// 0x0028 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_Visible : 1;                                    		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_Visited : 1;                                    		// 0x002C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_HasCritPath : 1;                                		// 0x002C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct SFXGame.BioCameraBehaviorGalaxy.BioMassRelayLine
// 0x0080
struct FBioMassRelayLine
{
	struct FString                                     m_sStartClusterLabel;                             		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     m_sEndClusterLabel;                               		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FVector                                     m_vLeftEndPosition;                               		// 0x0020 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vRightEndPosition;                              		// 0x002C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vMiddlePosition;                                		// 0x0038 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vDrawScale;                                     		// 0x0044 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    m_rOrientation;                                   		// 0x0050 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      m_pLeftEndActor;                                  		// 0x005C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      m_pRighEndActor;                                  		// 0x0064 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AActor*                                      m_pMiddleActor;                                   		// 0x006C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nStartClusterIdx;                               		// 0x0074 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                m_nEndClusterIdx;                                 		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      m_bIsGlowing : 1;                                 		// 0x007C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct SFXGame.BioCameraBehaviorGalaxy.SFXSystemScanData
// 0x0010
struct FSFXSystemScanData
{
	struct FVector                                     vScanOrigin;                                      		// 0x0000 (0x000C) [0x0000000000000000]              
	float                                              fElapsedTime;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFXGame.SFXGalaxyMapGameData.SFXGalaxyAudioData
// 0x00D8
struct FSFXGalaxyAudioData
{
	struct FString                                     BuyFuelSound_PctFullRTPCName;                     		// 0x0000 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class UWwiseBaseSoundObject*>        ShipHalfFuelVO;                                   		// 0x0010 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class UWwiseBaseSoundObject*>        ShipNoFuelClusterVO;                              		// 0x0020 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class UWwiseBaseSoundObject*>        ShipNoFuelClusterReturnVO;                        		// 0x0030 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class UWwiseBaseSoundObject*>        ShipNoFuelSystemVO;                               		// 0x0040 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     ShipTravelSound_SpeedRTPCName;                    		// 0x0050 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     ShipTravelSound_ThrustRTPCName;                   		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
