/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGameContent_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGameContent.SFXGameInfoSP.AwardItem
// [0x00024002] 
struct ASFXGameInfoSP_execAwardItem_Parms
{
	struct FName                                       ItemName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Level;                                            		// 0x0008 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// struct FTD                                      TreasureData;                                     		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// struct FLevelTreasureSaveRecord                 NewTreasureRecord;                                		// 0x007C (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x009C (0x0004) [0x0000000000000000]              
	// struct FString                                  S;                                                		// 0x00A0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FName                                    N;                                                		// 0x00B0 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXGameInfoSP.AwardCredits
// [0x00024002] 
struct ASFXGameInfoSP_execAwardCredits_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Level;                                            		// 0x0004 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNotification;                                		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// struct FTD                                      TreasureData;                                     		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             CreditBudget;                                     		// 0x007C (0x0004) [0x0000000000000000]              
	// int                                             CreditsSoFar;                                     		// 0x0080 (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x0084 (0x0004) [0x0000000000000000]              
	// class ASFXInventoryManager*                     Inventory;                                        		// 0x0088 (0x0008) [0x0000000000000000]              
	// struct FLevelTreasureSaveRecord                 NewTreasureRecord;                                		// 0x0090 (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXGameInfoSP.AwardCreditPercent
// [0x00024002] 
struct ASFXGameInfoSP_execAwardCreditPercent_Parms
{
	float                                              fAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Level;                                            		// 0x0004 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNotifications;                               		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// struct FTD                                      TreasureData;                                     		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             CreditBudget;                                     		// 0x007C (0x0004) [0x0000000000000000]              
	// class ASFXInventoryManager*                     Inventory;                                        		// 0x0080 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXGameInfoSP.AwardXP
// [0x00024002] 
struct ASFXGameInfoSP_execAwardXP_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Level;                                            		// 0x0004 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNotifications;                               		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// struct FTD                                      TreasureData;                                     		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             XPBudget;                                         		// 0x007C (0x0004) [0x0000000000000000]              
	// int                                             XPSoFar;                                          		// 0x0080 (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x0084 (0x0004) [0x0000000000000000]              
	// class ABioPlayerController*                     PC;                                               		// 0x0088 (0x0008) [0x0000000000000000]              
	// struct FLevelTreasureSaveRecord                 NewTreasureRecord;                                		// 0x0090 (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXGameInfoSP.FindPlayerStart
// [0x00024002] 
struct ASFXGameInfoSP_execFindPlayerStart_Parms
{
	class AController*                                 Player;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      InTeam;                                           		// 0x0008 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     IncomingName;                                     		// 0x000C (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	class ANavigationPoint*                            ReturnValue;                                      		// 0x001C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               Engine;                                           		// 0x0024 (0x0008) [0x0000000000000000]              
	// struct FName                                    ATStart;                                          		// 0x002C (0x0008) [0x0000000000000000]              
	// class AActor*                                   ChkActor;                                         		// 0x0034 (0x0008) [0x0000000000000000]              
	// class ABioStartLocation*                        ChkBioStartLocation;                              		// 0x003C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXGameInfoSP.PostBeginPlay
// [0x00020902] ( FUNC_Event )
struct ASFXGameInfoSP_eventPostBeginPlay_Parms
{
	// class UEngine*                                  oEngine;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UClass*                                   TreasureClass;                                    		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UObject*                                  DynamicLoadedClassObject;                         		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXSeqAct_DebugImportXP.Activated
// [0x00020002] 
struct USFXSeqAct_DebugImportXP_execActivated_Parms
{
	// class ABioPlayerController*                     PC;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ABioWorldInfo*                            WI;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UBioGlobalVariableTable*                  VarTable;                                         		// 0x0010 (0x0008) [0x0000000000000000]              
	// int                                             XP;                                               		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent.SFXSeqAct_GiveStartingConsumables.Activated
// [0x00020002] 
struct USFXSeqAct_GiveStartingConsumables_execActivated_Parms
{
	// class AWorldInfo*                               WI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ASFXPawn_Player*                          pPawn;                                            		// 0x0010 (0x0008) [0x0000000000000000]              
	// class ASFXInventoryManager*                     InvManager;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	// class ASFXWeapon*                               Weapon;                                           		// 0x0020 (0x0008) [0x0000000000000000]              
	// class ABioBaseSquad*                            pSquad;                                           		// 0x0028 (0x0008) [0x0000000000000000]              
	// class APawn*                                    MemberPawn;                                       		// 0x0030 (0x0008) [0x0000000000000000]              
	// class ASFXPawn_Henchman*                        HPawn;                                            		// 0x0038 (0x0008) [0x0000000000000000]              
	// class USFXModule_DamagePlayer*                  DamageModule;                                     		// 0x0040 (0x0008) [0x0000000000000000]              
	// int                                             MaxHealth;                                        		// 0x0048 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent.SFXSeqAct_OpenWeaponSelection.OnMovieClosedDelegate
// [0x00020002] 
struct USFXSeqAct_OpenWeaponSelection_execOnMovieClosedDelegate_Parms
{
	class USFXGUIMovie*                                i_ScreenToClose;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXSeqAct_OpenWeaponSelection.UpdateOp
// [0x00020002] 
struct USFXSeqAct_OpenWeaponSelection_execUpdateOp_Parms
{
	float                                              fDeltaT;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXSeqAct_OpenWeaponSelection.Activated
// [0x00020002] 
struct USFXSeqAct_OpenWeaponSelection_execActivated_Parms
{
	// class USFXGUIInteraction*                       oGUI;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// class USFXGUI_WeaponSelection*                  oWeapGUI;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     oPC;                                              		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_Revive.BodyStanceAnimEndNotification
// [0x00020000] 
struct USFXCustomAction_Revive_execBodyStanceAnimEndNotification_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_Revive.Replicate
// [0x00020002] 
struct USFXCustomAction_Revive_execReplicate_Parms
{
};

// Function SFXGameContent.SFXCustomAction_Revive.ClientDoCustomAction
// [0x00024002] 
struct USFXCustomAction_Revive_execClientDoCustomAction_Parms
{
	unsigned long                                      bForced;                                          		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_Revive.CheckFiring
// [0x00020002] 
struct USFXCustomAction_Revive_execCheckFiring_Parms
{
};

// Function SFXGameContent.SFXCustomAction_Revive.TickCustomAction
// [0x00020002] 
struct USFXCustomAction_Revive_execTickCustomAction_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_Revive.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_Revive_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_Revive.Resurrect
// [0x00020002] 
struct USFXCustomAction_Revive_execResurrect_Parms
{
	// class UBioRemoteLogger*                         GLogger;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class USFXAccomplishmentManager*                AccManager;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_Revive.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_Revive_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_Revive.InternalCanDoCustomAction
// [0x00080002] 
struct USFXCustomAction_Revive_execInternalCanDoCustomAction_Parms
{
	class ABioPawn*                                    SyncPawn;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bForced;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXCustomAction_Reload.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_Reload_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_Reload.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_Reload_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_Reload.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_Reload_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_ActivateWeaponFlashlight.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_ActivateWeaponFlashlight_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_ActivateWeaponFlashlight.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_ActivateWeaponFlashlight_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execFlinchActionOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_MantleLookAt_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execGetEndBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execGetLoopBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execGetStartBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execFlinchActionOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_CoverSlipLookAt_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execGetEndBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execGetLoopBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execGetStartBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execFlinchActionOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_StdCoverSlipLookAt_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execGetEndBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execGetLoopBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execGetStartBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execFlinchActionOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_SwatTurnLookAt_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execGetEndBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execGetLoopBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execGetStartBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execFlinchActionOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_StdSwatTurnLookAt_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execGetEndBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execGetLoopBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execGetStartBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_GapJump.NotifyBump
// [0x00020002] 
struct USFXCustomAction_GapJump_execNotifyBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 OtherPawn;                                        		// 0x0018 (0x0008) [0x0000000000000000]              
	// struct FVector                                  Dir;                                              		// 0x0020 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_GapJump.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_GapJump_execEndThisCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_GapJump.RemoveBlockingEndPoints
// [0x00020002] 
struct USFXCustomAction_GapJump_execRemoveBlockingEndPoints_Parms
{
	// class USFXCustomReachSpec*                      CustomReachSpec;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_GapJump.BlockMoveEndPoints
// [0x00020002] 
struct USFXCustomAction_GapJump_execBlockMoveEndPoints_Parms
{
	// class USFXCustomReachSpec*                      CustomReachSpec;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_GapJump.BodyStanceAnimEndNotification
// [0x00020002] 
struct USFXCustomAction_GapJump_execBodyStanceAnimEndNotification_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_GapJump.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_GapJump_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_GapJump.StartAnimation
// [0x00020002] 
struct USFXCustomAction_GapJump_execStartAnimation_Parms
{
};

// Function SFXGameContent.SFXCustomAction_GapJump.ReachedPrecisePosition
// [0x00020002] 
struct USFXCustomAction_GapJump_execReachedPrecisePosition_Parms
{
};

// Function SFXGameContent.SFXCustomAction_GapJump.AlignmentTimeout
// [0x00020002] 
struct USFXCustomAction_GapJump_execAlignmentTimeout_Parms
{
};

// Function SFXGameContent.SFXCustomAction_GapJump.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_GapJump_execStartCustomAction_Parms
{
	// class USFXJumpReachSpec*                        JumpSpec;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_GapJump.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_GapJump_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_JumpDown.TickInput
// [0x00020002] 
struct USFXCustomAction_JumpDown_execTickInput_Parms
{
	class UBioPlayerInput*                             Input;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              DeltaTime;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_JumpDown.PlayStartAnimation
// [0x00020002] 
struct USFXCustomAction_JumpDown_execPlayStartAnimation_Parms
{
	// class USFXCustomReachSpec*                      ReachSpec;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ASFXNav_BlockingPathNode*                 StartPoint;                                       		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ASFXNav_BlockingPathNode*                 EndPoint;                                         		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.GetEndAnim
// [0x00420002] 
struct USFXCustomAction_PlayerMantleOverCover_execGetEndAnim_Parms
{
	struct FBodyStance                                 Stance;                                           		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.GetLoopAnim
// [0x00420002] 
struct USFXCustomAction_PlayerMantleOverCover_execGetLoopAnim_Parms
{
	struct FBodyStance                                 Stance;                                           		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.GetStartAnim
// [0x00420002] 
struct USFXCustomAction_PlayerMantleOverCover_execGetStartAnim_Parms
{
	struct FBodyStance                                 Stance;                                           		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_PlayerMantleOverCover_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.BodyStanceAnimEndNotification
// [0x00020002] 
struct USFXCustomAction_PlayerMantleOverCover_execBodyStanceAnimEndNotification_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.TickCustomAction
// [0x00020802] ( FUNC_Event )
struct USFXCustomAction_PlayerMantleOverCover_eventTickCustomAction_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 PawnRotation;                                     		// 0x0004 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerMantleOverCover_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleOverCover.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerMantleOverCover_execStartCustomAction_Parms
{
	// unsigned long                                   bWasStorming;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.ClientDoCustomAction
// [0x00024002] 
struct USFXCustomAction_PlayerMantleUp_execClientDoCustomAction_Parms
{
	unsigned long                                      bForced;                                          		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.ServerStartCustomAction
// [0x00024002] 
struct USFXCustomAction_PlayerMantleUp_execServerStartCustomAction_Parms
{
	int                                                NewAction;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ABioPawn*                                    Sync;                                             		// 0x0004 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                NewPowerAction;                                   		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.Replicate
// [0x00020002] 
struct USFXCustomAction_PlayerMantleUp_execReplicate_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.GetBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_PlayerMantleUp_execGetBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerMantleUp_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerMantleUp_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.InternalCanDoCustomAction
// [0x00880002] 
struct USFXCustomAction_PlayerMantleUp_execInternalCanDoCustomAction_Parms
{
	class ABioPawn*                                    SyncPawn;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bForced;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FCovPosInfo                              FoundCover;                                       		// 0x0010 (0x0038) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerMantleUp.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_PlayerMantleUp_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.ClientDoCustomAction
// [0x00024002] 
struct USFXCustomAction_SimpleMoveBase_execClientDoCustomAction_Parms
{
	unsigned long                                      bForced;                                          		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.Replicate
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execReplicate_Parms
{
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.CanBeInterrupted
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execCanBeInterrupted_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.DestTimeout
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execDestTimeout_Parms
{
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.BodyStanceAnimEndNotification
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execBodyStanceAnimEndNotification_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execStopCustomAction_Parms
{
	// struct FBodyStance                              BS_ToPlay;                                        		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.PlayStartAnimation
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execPlayStartAnimation_Parms
{
	// float                                           DistToEnd;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           RootMotionScaleFactor;                            		// 0x0004 (0x0004) [0x0000000000000000]              
	// struct FBodyStance                              BS_ToPlay;                                        		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.GetBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execGetBodyStanceAnim_Parms
{
	struct FBodyStance                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execStartCustomAction_Parms
{
	// class ANavigationPoint*                         Start;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           RotYaw;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FRotator                                 NewRotation;                                      		// 0x000C (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.InternalCanDoCustomAction
// [0x00080002] 
struct USFXCustomAction_SimpleMoveBase_execInternalCanDoCustomAction_Parms
{
	class ABioPawn*                                    SyncPawn;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bForced;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.RemoveBlockingEndPoints
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execRemoveBlockingEndPoints_Parms
{
	// class USFXCustomReachSpec*                      CustomReachSpec;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ANavigationPoint*                         EndNav;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.BlockMoveEndPoints
// [0x00020002] 
struct USFXCustomAction_SimpleMoveBase_execBlockMoveEndPoints_Parms
{
	// class USFXCustomReachSpec*                      CustomReachSpec;                                  		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ANavigationPoint*                         EndNav;                                           		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.ReachedPrecisePosition
// [0x00020802] ( FUNC_Event )
struct USFXCustomAction_SimpleMoveBase_eventReachedPrecisePosition_Parms
{
};

// Function SFXGameContent.SFXCustomAction_SimpleMoveBase.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_SimpleMoveBase_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipLeft.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipLeft_execEndThisCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipLeft.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipLeft_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipLeftStanding.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipLeftStanding_execEndThisCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipLeftStanding.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipLeftStanding_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipRight.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipRight_execEndThisCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipRight.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipRight_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipRightStanding.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipRightStanding_execEndThisCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerCoverSlipRightStanding.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerCoverSlipRightStanding_execStartCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.PreAlignPawnLocation
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execPreAlignPawnLocation_Parms
{
	// class ANavigationPoint*                         StartNode;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ANavigationPoint*                         EndNode;                                          		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector                                  PlayerOffset;                                     		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.SetMoveStage
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execSetMoveStage_Parms
{
	unsigned char                                      NextStage;                                        		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// class ANavigationPoint*                         StartNode;                                        		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ANavigationPoint*                         EndNode;                                          		// 0x000C (0x0008) [0x0000000000000000]              
	// struct FVector                                  ToEnd;                                            		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FVector                                  StartLocation;                                    		// 0x0020 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.TickCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execTickCustomAction_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ANavigationPoint*                         StartNode;                                        		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ANavigationPoint*                         EndNode;                                          		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.SyncRotation
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execSyncRotation_Parms
{
	float                                              Alpha;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ANavigationPoint*                         StartNode;                                        		// 0x0004 (0x0008) [0x0000000000000000]              
	// class ANavigationPoint*                         EndNode;                                          		// 0x000C (0x0008) [0x0000000000000000]              
	// struct FVector                                  ToEnd2D;                                          		// 0x0014 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 R;                                                		// 0x0020 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.SyncJumpEntrance
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execSyncJumpEntrance_Parms
{
	float                                              Alpha;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  PlayerPos;                                        		// 0x0004 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.TickAlignment
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execTickAlignment_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  PlayerOffset;                                     		// 0x0004 (0x000C) [0x0000000000000000]              
	// float                                           Alpha;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execStartCustomAction_Parms
{
	// class ASFXNav_LadderNode*                       LadderNode;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.TickInput
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbUp_execTickInput_Parms
{
	class UBioPlayerInput*                             Input;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              DeltaTime;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbUp.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_PlayerLadderClimbUp_eventGetUsedAnimNames_Parms
{
	struct TArray<struct FName>                        UsedAnims;                                        		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function SFXGameContent.SFXCustomAction_PlayerLadderClimbDown.TickInput
// [0x00020002] 
struct USFXCustomAction_PlayerLadderClimbDown_execTickInput_Parms
{
	class UBioPlayerInput*                             Input;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              DeltaTime;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeLeft.RollOverride
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeLeft_execRollOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeLeft.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeLeft_execStartCustomAction_Parms
{
	// struct FVector                                  ToEnd2D;                                          		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeLeft.InternalCanDoCustomAction
// [0x00080002] 
struct USFXCustomAction_PlayerEvadeLeft_execInternalCanDoCustomAction_Parms
{
	class ABioPawn*                                    SyncPawn;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bForced;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeRight.RollOverride
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeRight_execRollOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeRight.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeRight_execStartCustomAction_Parms
{
	// struct FVector                                  ToEnd2D;                                          		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeRight.InternalCanDoCustomAction
// [0x00080002] 
struct USFXCustomAction_PlayerEvadeRight_execInternalCanDoCustomAction_Parms
{
	class ABioPawn*                                    SyncPawn;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bForced;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.ClientDoCustomActionImpact
// [0x00024002] 
struct USFXCustomAction_PlayerEvadeForward_execClientDoCustomActionImpact_Parms
{
	class AActor*                                      oActor;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ImpactCount;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFirstTarget;                                     		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                CustomActionReactionType;                         		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class USFXModule_Timeline*                      TimeMod;                                          		// 0x002C (0x0008) [0x0000000000000000]              
	// class UBioCustomAction*                         Action;                                           		// 0x0034 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.RollOverride
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execRollOverride_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execStopCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.TurnOnHitWall
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execTurnOnHitWall_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.NotifyHitWall
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execNotifyHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Wall;                                             		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPlayerController*                     oPlayer;                                          		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execEndThisCustomAction_Parms
{
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.SyncRotation
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execSyncRotation_Parms
{
	float                                              Alpha;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ToEnd2D;                                          		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// struct FRotator                                 R;                                                		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent.SFXCustomAction_PlayerEvadeForward.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_PlayerEvadeForward_execStartCustomAction_Parms
{
	// struct FVector                                  ToEnd2D;                                          		// 0x0000 (0x000C) [0x0000000000000000]              
};

