/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.53-MELE
# ========================================================================================= #
# File: SFXGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/


#pragma once
#include <Windows.h>
#include <cstdio>
#include "../SdkInitializer.h"



#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_BIO2DA_INDEX_ERROR                                 -1
#define CONST_AI_NearMissDistance                                200
#define CONST_AI_FlinchDistance                                  35.0f
#define CONST_AI_NearbyHurtDistance                              500
#define CONST_TIMER_ADJUSTTOSLOT_LIMIT                           5.f
#define CONST_MAXSEARCHPATHLENGTH                                2000.0f

	BioReaperControlCondition_MAX                      = 1
};*/

// Enum SFXGame.SFXTeamInfo.ESFXTeam
/*enum ESFXTeam
{
	TEAM_PLAYER                                        = 0,
	TEAM_ENEMY                                         = 1,
	TEAM_DUMMY                                         = 2,
	TEAM_EVERYONE                                      = 3,
	TEAM_MAX                                           = 4
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryGameDataType
/*enum ETelemetryGameDataType
{
	GameDataType_Load                                  = 0,
	GameDataType_Save                                  = 1,
	GameDataType_AutoSave                              = 2,
	GameDataType_ChapterSave                           = 3,
	GameDataType_EndGame                               = 4,
	GameDataType_Unknown                               = 5,
	GameDataType_MAX                                   = 6
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryLogoutReason
/*enum ETelemetryLogoutReason
{
	LogoutStatus_Normal                                = 0,
	LogoutStatus_Error                                 = 1,
	LogoutStatus_OptOutTelemetry                       = 2,
	LogoutStatus_Unknown                               = 3,
	LogoutStatus_MAX                                   = 4
};*/

// Enum SFXGame.SFXTelemetry.ETelemetryLoginStatus
/*enum ETelemetryLoginStatus
{
	LoginStatus_Success                                = 0,
	LoginStatus_Error                                  = 1,
	LoginStatus_Cancel                                 = 2,
	LoginStatus_Unknown                                = 3,
	LoginStatus_MAX                                    = 4
};*/

// Enum SFXGame.SFXTelemetry.EBootEndReason
/*enum EBootEndReason
{
	BootEndReason_Normal                               = 0,
	BootEndReason_Error                                = 1,
	BootEndReason_OptOutTelemetry                      = 2,
	BootEndReason_Unknown                              = 3,
	BootEndReason_MAX                                  = 4
};*/

// Enum SFXGame.SFXTelemetryGameSession.EGameEndReason
/*enum EGameEndReason
{
	GameEndReason_Leave                                = 0,
	GameEndReason_GameEnd                              = 1,
	GameEndReason_Restart                              = 2,
	GameEndReason_Error                                = 3,
	GameEndReason_OptOutTelemetry                      = 4,
	GameEndReason_Unknown                              = 5,
	GameEndReason_MAX                                  = 6
};*/

// Enum SFXGame.SFXTracer.ESFXTracerState
/*enum ESFXTracerState
{
	eSFXTracerState_Idle                               = 0,
	eSFXTracerState_ScaleUp                            = 1,
	eSFXTracerState_ScaleDown                          = 2,
	eSFXTracerState_MAX                                = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SFXGame.BioHardLinks
// 0x0010 (0x0070 - 0x0060)
class UBioHardLinks : public UObject
{
public:
	struct TArray<struct FBioHardLinkReference>        References;                                       		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioHintSystemBase
// 0x00AC (0x010C - 0x0060)
class UBioHintSystemBase : public UObject
{
public:
	struct TArray<struct FHintDefinition>              m_aHints;                                         		// 0x0060 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FSFXNotification>             m_aNotifications;                                 		// 0x0070 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct TArray<int>                                 m_aCurrentlyDisplayedMiniNotificationIDs;         		// 0x0080 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct TArray<struct FSFXNotificationData>         m_NotificationData;                               		// 0x0090 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x00A0 (0x0048) UNKNOWN PROPERTY: MapProperty SFXGame.BioHintSystemBase.m_mTrackingData
	class UTexture2D*                                  m_DefaultImage;                                   		// 0x00E8 (0x0008) [0x0000000000000000]              
	float                                              m_fMinimumTimeBetweenAnyHints;                    		// 0x00F0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fCurrentTime;                                   		// 0x00F4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nCurrentlyDisplayedHint;                        		// 0x00F8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                m_nCurrentlyDisplayedNotificationID;              		// 0x00FC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              m_fTimeSinceDisplayPossible;                      		// 0x0100 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              m_fDisplayDelay;                                  		// 0x0104 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      m_bEnabled : 1;                                   		// 0x0108 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      m_bDisabledForTutorial : 1;                       		// 0x0108 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bNotificationIsPaused : 1;                      		// 0x0108 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventCacheCurrentState ( );
	void Tick ( float TimeDelta );
	float TimeSince ( float fTime );
	float GetPreviousTime ( int nAge, struct FHintTrackingData* oData );
	struct FHintTrackingData GetTrackingData ( struct FName nmEvent, struct FName nmContext );
	void Clear ( );
	void HintEvent ( struct FName nmEvent, struct FName nmContext );
	void ClearNotifications ( );
	void OnNotificationDisplayCompleted ( int nNotificationID );
	bool IsHintsOptionDisabled ( );
	bool HintsEnabled ( );
	void SetNotificationPaused ( unsigned long bVal );
	void eventJournalUpdate ( int srTitle, int srDescription );
	void eventCodexUpdate ( int srTitle, int srDescription );
	void eventAddNotification_BonusPower ( int PlotStateID );
	void PopulateNotificationOneParameter ( int nParam1, struct FSFXNotificationData* oNoteData, struct FSFXNotification* oNotification );
	struct FSFXNotificationData GetNotificationData ( struct FName nmNotificationType );
	void ShowNotification ( struct FSFXNotification* oNotification );
	void AddNotification_Custom ( float nDisplayTime, struct FString sTitle, struct FString sSubtitle, struct FString sBody, struct FString sImagePath, struct FName nRemoteEvent, struct FName nmType, struct FName nmSound, int Priority, int FlourishID, int nBarPercent, struct FName nmIcon, unsigned long bMini );
	void AddNotification_AccomplishmentUnlocked ( struct FAccomplishment* Data, struct FGrinderAccomplishment* Grinder );
	void AddNotification_AccomplishmentChange ( struct FString sTitle, struct FString sSubtitle, struct FString sBody, int currentCount, int totalCount, struct FString sImage );
	void AddNotification_AmmoRecovery ( int nAmount );
	void AddNotification_HeavyWeaponAmmoRecovery ( int nAmount );
	void AddNotification_ElementZeroRecovery ( int nAmount );
	void AddNotification_PlatinumRecovery ( int nAmount );
	void AddNotification_PalladiumRecovery ( int nAmount );
	void AddNotification_IridiumRecovery ( int nAmount );
	void AddNotification_ReputationChange ( int nAmount );
	void AddNotification_RenegadeChange ( int nAmount );
	void AddNotification_ParagonChange ( int nAmount );
	void AddNotification_MedigelRecovery ( int nAmount );
	void AddNotification_CreditRecovery ( int nAmount );
	void AddNotification_CodexChange ( );
	void AddNotification_JournalChange ( );
	void AddNotification ( struct FSFXNotification* oNotification );
};

// Class SFXGame.BioLevelUpSystem
// 0x0004 (0x0064 - 0x0060)
class UBioLevelUpSystem : public UObject
{
public:
	float                                              ME2ImportReputationAmount;                        		// 0x0060 (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	int GetMaxLevel ( );
	void VerifyPlayerTalentPoints ( class ASFXPawn* Pawn );
	void SetME2ImportStartingValues ( struct FPlayerSaveRecord* PlayerRecord );
	void ME2ToME3_ParagonRenegade ( int Paragon_ME2, int Renegade_ME2, int* Paragon_ME3, int* Renegade_ME3 );
	void AutoLevelUpPowers ( class ABioPawn* Pawn );
	int GetTalentPointSum ( int Level, unsigned long bHenchman );
	bool LevelUpBioPawn ( class ASFXPawn_PlayerParty* Pawn, int newLevel );
	bool GetLevelFromXP ( int experience, int* Level );
	bool GetXPNeededForLevel ( int Level, int* experience );
	bool AttemptLevelUp ( class ABioBaseSquad* Squad );
};

// Class SFXGame.BioLoadingMovie
// 0x0030 (0x0090 - 0x0060)
class UBioLoadingMovie : public UObject
{
public:
	struct FString                                     MovieName;                                        		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UWwiseEventPairObject*                       LoadingMovieWwisePair;                            		// 0x0070 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 FadeOutWwiseEvent;                                		// 0x0078 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                LoopBackFrame;                                    		// 0x0080 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FadeInTime;                                       		// 0x0084 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FadeOutTime;                                      		// 0x0088 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MinPlayTime;                                      		// 0x008C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioPhysicsSounds
// 0x0014 (0x0074 - 0x0060)
class UBioPhysicsSounds : public UObject
{
public:
	float                                              m_fMaxMass;                                       		// 0x0060 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMaxSpeed;                                      		// 0x0064 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinTimeBetweenSoundByActor;                    		// 0x0068 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              m_fMinSpeedToPlay;                                		// 0x006C (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      m_bEnableLogging : 1;                             		// 0x0070 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	float GetSpeedSpecifier ( class UPrimitiveComponent* oComp, float fSpeedToUse );
	float GetMassSpecifier ( class UPrimitiveComponent* oComp );
	void UpdateLastCollidedActor ( class UPrimitiveComponent* oComp, class AActor* OtherActor );
	void UpdateLastTimePlayed ( class UPrimitiveComponent* oComp );
	bool IsTooSlowToPlay ( class UPrimitiveComponent* oComp );
	bool IsSameCollidedActor ( class UPrimitiveComponent* oComp, class AActor* OtherActor );
	bool IsTooSoonToPlay ( class UPrimitiveComponent* oComp );
	bool CanPlay ( class UPrimitiveComponent* oComp0, class UPrimitiveComponent* oComp1, struct FCollisionImpactData* RigidCollisionData );
	int GetPhysMatWwiseType ( class UPhysicalMaterial* PhysMat );
	class UWwiseEvent* GetWwiseEvent ( class UPhysicalMaterial* PhysMat );
	void eventPlaySoundOnPhysMatAt ( class AGameReplicationInfo* GRI, class UPhysicalMaterial* PhysMat, class UPhysicalMaterial* PhysMatSweetener, struct FVector pos, struct TArray<struct FString> RTPCNames, struct TArray<float> RTPCValues );
};

// Class SFXGame.BioPlaypenVolume
// 0x0014 (0x02C8 - 0x02B4)
class ABioPlaypenVolume : public AVolume
{
public:
	struct FGuid                                       PlaypenGuid;                                      		// 0x02B4 (0x0010) [0x0000000000220003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	unsigned long                                      bSubtractive : 1;                                 		// 0x02C4 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioPlotTreasure
// 0x0018 (0x0078 - 0x0060)
class UBioPlotTreasure : public UObject
{
public:
	class UBio2DA*                                     oPlotTreasureResources2DA;                        		// 0x0060 (0x0008) [0x0000000000000000]              
	class UBio2DA*                                     oPlotTreasureTreasure2DA;                         		// 0x0068 (0x0008) [0x0000000000000000]              
	class UBio2DA*                                     oPlotTreasureTech2DA;                             		// 0x0070 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool GetMapName ( struct FString* sOutMapName );
	bool GetPlotTreasureTechInt ( struct FName nmTech, struct FName nmNameHeader, struct FName nmHeader, int* nTechValue );
	bool GetPlotTreasureTechName ( struct FName nmTech, struct FName nmHeader, struct FName* nmTechName );
	bool GetPlotTreasureTreasureName ( int nTreasureId, struct FName nmHeader, struct FName* nmPlotTreasureName );
	bool GetPlotTreasureTreasureInt ( int nTreasureId, struct FName nmHeader, int* nPlotTreasureValue );
	bool GetPlotTreasureResourcesInt ( struct FName nmLevel, struct FName nmHeader, int* nPlotTreasureValue );
};

// Class SFXGame.BioPower
// 0x0040 (0x00A0 - 0x0060)
class UBioPower : public UObject
{
public:
	struct FString                                     m_sRTPCName;                                      		// 0x0060 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FName                                       m_nmPower;                                        		// 0x0070 (0x0008) [0x0000000000000000]              
	class UBioPowerScript*                             Script;                                           		// 0x0078 (0x0008) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class AController*                                 Instigator;                                       		// 0x0080 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USFXPower*                                   NewPower;                                         		// 0x0088 (0x0008) [0x0000000000000000]              
	class AActor*                                      Owner;                                            		// 0x0090 (0x0008) [0x0000000000000000]              
	int                                                m_nSuppressedCount;                               		// 0x0098 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      m_bFakePower : 1;                                 		// 0x009C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      m_bDisableVFX : 1;                                		// 0x009C (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      m_bDisableDamageAndEffects : 1;                   		// 0x009C (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      m_bDisableAnimation : 1;                          		// 0x009C (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool ShouldDisplayInHUD ( );
	bool GetDescription ( struct FString* sDescription );
	bool GetImpactText ( int* srImpactText );
	bool GetDisplayName ( struct FString* sDisplayName );
	int GetPowerIcon ( );
	bool CanCasterMoveDuringPower ( );
	void Tick ( float fDeltaTime );
	bool IsSuppressed ( );
	int SuppressPower ( unsigned long bSuppress );
	bool IsEnabled ( );
	unsigned char GetType ( );
	bool GetAnimSet ( class UAnimSet** oAnimSet );
	void CreatePowerScript ( );
	void InitializePower ( struct FName nmPower );
	unsigned char GetDiscipline ( );
	bool GetStopOnFirstHit ( );
	bool GetBlockedByObjects ( );
	float GetConeHalfAngle ( );
	float GetVFXIntensity ( );
	float GetEffectDuration ( );
	float GetImpactRadius ( );
	float GetMaximumRange ( );
	float GetMinimumRange ( );
	float GetProjectileRadius ( );
	float GetProjectileSpeed ( );
	float GetGlobalCooldown ( );
	float GetReleaseAnimRate ( );
	float GetCastingTime ( );
};

// Class SFXGame.BioPowerManager
// 0x005C (0x00BC - 0x0060)
class UBioPowerManager : public UObject
{
public:
	struct FMap_Mirror                                 m_mapGlobalCooldowns;                             		// 0x0060 (0x0048) [0x0000000000003000]              ( CPF_Native | CPF_Transient )
	struct TArray<struct FPowerReservation>            m_aReservations;                                  		// 0x00A8 (0x0010) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                m_nCurrentReservationID;                          		// 0x00B8 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool eventCanImpactActor ( class AActor* oActor );
	void TickReservations ( float fDeltaTime );
	bool StartReservation ( int nReservationID );
	void ClearReservation ( int nReservationID );
	int MakeReservation ( class USFXPowerCustomActionBase* oPower, class APawn* oPawn, unsigned long bForceSuccess );
	void TickGlobalCooldowns ( float fDeltaTime );
	float GetGlobalCooldown ( struct FName nmPower );
	void SetGlobalCooldown ( struct FName nmPower, float fCooldown );
	void Tick ( float fDeltaTime );
	void ChooseTargetForPlayer ( class USFXPower* oPower, class AActor** oTarget, struct FVector* vTargetLocation );
	bool AreActorsFriendly ( class AActor* oFirstActor, class AActor* oSecondActor );
	bool CheckLOSToLocation ( class AActor* oSourceActor, struct FVector vStartLocation, struct FVector vEndLocation, float fMaxRange, unsigned long bIgnoreFriendlies, float fIgnoreCoverDistance, class AActor** oHitActor, struct FVector* vHitLocation, struct FVector* vHitNormal );
	bool CheckLOSToActor ( class AActor* oSourceActor, class AActor* oDestinationActor, struct FVector vStartLocation, float fMaxRange, unsigned long bIgnoreFriendlies, unsigned long bIgnorePawns, class AActor** oHitActor, struct FVector* vHitLocation, struct FVector* vHitNormal );
	void GetStartLocationForLOSCheck ( class APawn* Caster, struct FVector* vStartLocation );
};

// Class SFXGame.BioPowerScript
// 0x008C (0x00EC - 0x0060)
class UBioPowerScript : public UObject
{
public:
	struct TArray<class AActor*>                       m_ImpactedActors;                                 		// 0x0060 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     m_vWorldImpactLocation;                           		// 0x0070 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vWorldImpactNormal;                             		// 0x007C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vProjectileVelocity;                            		// 0x0088 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vProjectileLocation;                            		// 0x0094 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     m_vLocationToAimAt;                               		// 0x00A0 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	class UForceFeedbackWaveform*                      m_ImpactWaveForm;                                 		// 0x00AC (0x0008) [0x0000000000000000]              
	class AActor*                                      m_oTargetToAimAt;                                 		// 0x00B4 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	int                                                Recommended_TargetVulnerable;                     		// 0x00BC (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_TargetOrganic;                     		// 0x00C0 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_TargetMachine;                     		// 0x00C4 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_TargetHasShields;                  		// 0x00C8 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_TargetHasBiotics;                  		// 0x00CC (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_TargetHasArmor;                    		// 0x00D0 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_NoMedigel;                         		// 0x00D4 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_NoSquadMemberDead;                 		// 0x00D8 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_NoSquadMemberInjured;              		// 0x00DC (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_WeaponPowerAlreadyOn;              		// 0x00E0 (0x0004) [0x0000000000000000]              
	int                                                NotRecommended_TargetImmune;                      		// 0x00E4 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bWeaponModePower : 1;                           		// 0x00E8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bShouldTick : 1;                                  		// 0x00E8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      m_bPlayerOrderedPowerUse : 1;                     		// 0x00E8 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void DebugDraw_Power ( class ABioHUD* H );
	struct FString eventGetHUDWheelIconInfo ( class ABioPawn* OwnerPawn );
	void ReloadAmmoPower ( class ABioPawn* Target, class ASFXWeapon* Weapon );
	void OnOwnerDied ( );
	void OnSquadMemberAdded ( class APawn* Pawn );
	void OnPowersLoaded ( );
	void OnPowerRankIncreased ( );
	void OnPowerAdded ( class USFXPower* Power );
	bool eventShouldUsePower ( class AActor* Caster, class AActor* Target, struct FString* sOptionalInfo );
	float GetDuration ( );
	float GetElapsedTime ( );
	bool PlayGuiSound ( struct FName nmSound );
	bool GetFloorLocation ( struct FVector vStartLocation, struct FVector* vFloorLocation );
	void GetCooldownResearchBonus ( float* fStaticResearchBonus );
	bool eventAdjustCooldown ( float* fCooldownTime );
	bool eventEffectUnapply ( class AActor* oCaster, float fCasterStability, class AActor* oImpacted, int nPreviouslyImpacted );
	bool eventOnImpact ( class AActor* oCaster, float fCasterStability, class AActor* oImpacted, int nPreviouslyImpacted );
	bool eventCanStartPower ( class AActor* oCaster );
	void eventTick ( float DeltaTime );
	void OnProjectileExploded ( class AActor* oCaster, struct FVector HitLocation, struct FVector HitNormal, struct FVector Velocity );
	void OnWeaponReload ( class ASFXWeapon* Weapon, unsigned long QuickReload );
	void OnWeaponUnequip ( class ASFXWeapon* Weapon );
	void OnWeaponEquip ( class ASFXWeapon* Weapon );
	void OnWeaponImpact ( class ASFXWeapon* Weapon, struct FImpactInfo Impact );
	void eventInitializePowerScript ( );
};

// Class SFXGame.BioRadarMapBoundaries
// 0x000E (0x027C - 0x026E)
class ABioRadarMapBoundaries : public AActor
{
public:
	struct FVector                                     m_vBoundarySize;                                  		// 0x0270 (0x000C) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSeqAct_GiveMissionXP_NativeBase
// 0x0014 (0x010C - 0x00F8)
class UBioSeqAct_GiveMissionXP_NativeBase : public USequenceAction
{
public:
	struct FName                                       CombatToken;                                      		// 0x00F8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              RewardAmount;                                     		// 0x0100 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ObjectiveStringRef;                               		// 0x0104 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bSkipNotifications : 1;                           		// 0x0108 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bCombatExperience : 1;                            		// 0x0108 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	int eventGetObjClassVersion ( );
	void Activated ( );
};

// Class SFXGame.BioSFResources
// 0x0030 (0x0090 - 0x0060)
class UBioSFResources : public UObject
{
public:
	struct TArray<struct FBioSFSoundAssetResource>     Sounds;                                           		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<class UBioSFScreenTip*>              LoadScreenTips;                                   		// 0x0070 (0x0010) [0x000000000440000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	struct TArray<class UGFxMovieInfo*>                Movies;                                           		// 0x0080 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioSocketSupermodel
// 0x0010 (0x0434 - 0x0424)
class UBioSocketSupermodel : public USkeletalMesh
{
public:
	struct TArray<class USkeletalMesh*>                Dependents;                                       		// 0x0424 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioTacticalMoveToIndicator
// 0x0012 (0x0280 - 0x026E)
class ABioTacticalMoveToIndicator : public AActor
{
public:
	class UParticleSystemComponent*                    ParticleSystem;                                   		// 0x0270 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              m_fFadeInTime;                                    		// 0x0278 (0x0004) [0x0000000000000000]              
	float                                              m_fTimePassed;                                    		// 0x027C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXAccomplishmentManager
// 0x007C (0x00DC - 0x0060)
class USFXAccomplishmentManager : public UObject
{
public:
	struct TArray<struct FAccomplishment>              AccomplishmentData;                               		// 0x0060 (0x0010) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct TArray<int>                                 AccomplishmentIsComplete;                         		// 0x0070 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<int>                                 AccomplishmentCompletionTimes;                    		// 0x0080 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct TArray<struct FAccomplishmentProgress>      AccomplishmentProgressData;                       		// 0x0090 (0x0010) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FGrinderAccomplishment>       GrinderAccomplishmentData;                        		// 0x00A0 (0x0010) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FAchievementReward>           Rewards;                                          		// 0x00B0 (0x0010) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct TArray<struct FChallengeEvent>              Challenges;                                       		// 0x00C0 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class USFXAccomplishmentStorage*                   AccomplishmentStorage;                            		// 0x00D0 (0x0008) [0x0000000000000000]              
	unsigned long                                      bChallengeSystemEnabled : 1;                      		// 0x00D8 (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      IsDataValidated : 1;                              		// 0x00D8 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bIsSaving : 1;                                    		// 0x00D8 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bPendingSave : 1;                                 		// 0x00D8 (0x0004) [0x0000000000002000] [0x00000008] ( CPF_Transient )
	unsigned long                                      bSaveRequired : 1;                                		// 0x00D8 (0x0004) [0x0000000000002000] [0x00000010] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void Destroyed ( );
	class USFXOnlineJobSendMessage* eventCreateJobSendAchievementMessage ( int AchievementId );
	struct FName AccomplishmentProgressIndexToName ( int AccomplishmentProgressIndex );
	struct FName AccomplishmentIndexToName ( int AccomplishmentIndex );
	void LoadStorageData ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void LoadSettingsData ( class USFXProfileSettings* CurrentProfileSettings );
	void LoadAchievementData ( struct TArray<struct FAchievementDetails> AchievementsList, class ABioPlayerController* PC );
	void SaveComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void Save ( );
	unsigned char GetAccomplishmentParamsStorage ( unsigned char AchievementId, unsigned long IsMultiplayerOnly );
	unsigned char GetAccomplishmentStorage ( int ArrayIndex );
	bool UpdateGrinderAccomplishmentByValue ( int UpdateValue, struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	bool GrinderAccomplishmentIncrement ( struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	bool SetGrinderAccomplishmentProgressWithUpdate ( struct FName AccomplishmentProgressName, int Progress, class ABioPlayerController* PC );
	int GetGrinderAccomplishmentProgress ( struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	void SetGrinderAccomplishmentProgress ( struct FName AccomplishmentProgressName, int Progress, class ABioPlayerController* PC );
	void GrinderAccomplishmentReset ( struct FName AccomplishmentProgressName, class ABioPlayerController* PC );
	bool GetGrinderAccomplishment ( struct FName AccomplishmentName, struct TArray<struct FGrinderAccomplishment>* GAList );
	bool CanUnlockAccomplishment ( struct FName AccomplishmentName );
	bool HasCompletedAccomplishment ( struct FName AccomplishmentName );
	unsigned char GetProfileSettingFromAccomplishmentProgress ( struct FName AccomplishmentProgressName );
	bool AreAllChildAccomplishmentsCompleted ( struct FName ParentAccomplishment );
	void UpdateAccomplishmentTree ( struct FName ParentAccomplishment, class ABioPlayerController* PC );
	bool SetAccomplishmentUncompleted ( struct FName AccomplishmentName, class ABioPlayerController* PC );
	bool SetAccomplishmentCompleted ( struct FName AccomplishmentName, class ABioPlayerController* PC );
	void ResetAchievementStatus ( );
	bool PropagateAccomplishmentCompletion ( int Index, unsigned long IsComplete, class ABioPlayerController* PC, unsigned long bSaveProfile );
	void ResetChallengeRewards ( );
	void SetCurrentReward ( int nRewardID );
	void GetCurrentReward ( int* nRewardID, int* nRewardLevel );
	void UpdateN7RatingChallenge ( int n7Rating, class ABioPlayerController* PC );
	void UpdateMiscChallenges ( unsigned char ChallengeType, class ABioPlayerController* PC );
	void UpdatePowerChallenges ( struct FName PowerName, class UClass* PowerDamageType, unsigned long bCombo, class ABioPlayerController* PC );
	void UpdateMedalChallenges ( unsigned char Medal, class ABioPlayerController* PC );
	void UpdateWaveChallenges ( class ABioPlayerController* PC );
	void UpdateMatchChallenges ( int PlayerID, class ABioPlayerController* PC );
	void UpdateDamageScoreChallenges ( float Score, int DamageSource, class ABioPlayerController* PC );
	void UpdateEnemyScoreChallenges ( class UClass* KilledPawnClass, float Score, class ABioPlayerController* PC );
	void UpdateKillChallenges ( class UClass* KilledPawnClass, class UClass* KillingDamageType, int KillingSource, unsigned long bHeadShot, unsigned long bHeadGib, class ABioPlayerController* PC );
	void GetCurrentChallengeData ( class ABioPlayerController* PC, struct FChallengeEvent* CurrentEvent );
	void GetOtherAccomplishments ( struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetPowerAccomplishments ( class UClass* PowerDamageType, struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetMedalAccomplishments ( struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetWaveAccomplishments ( struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetMatchAccomplishments ( struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetDamageScoreAccomplishments ( struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetEnemyScoreAccomplishments ( class UClass* KilledPawnClass, struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void GetKillAccomplishments ( class UClass* KilledPawnClass, class UClass* KillingDamageType, struct FChallengeEvent* CurrentEvent, struct TArray<struct FName>* Accomplishments );
	void ResetChallengeGroupProgress ( struct FName ChallengeGroupName );
	bool CanUpdateAccomplishmentProgress ( int CurrentProgress, int GrinderIndex, int AccomplishmentIndex );
	void OnGrantedEntitlement ( struct FBWEntitlementId Id, int nResult );
	int GetTotalChallengePoints ( );
	void AddChallengePointsEarned ( int PointsEarned );
	bool UnlockReward ( struct FName AccomplishmentName, int PointsEarned, unsigned long bIsMultiplayerOnly, class ABioPlayerController* PC );
	void Validate ( );
	void SaveOnInvalidVersion ( );
	void eventInitialize ( );
};

// Class SFXGame.SFXActorFactoryRigidBody
// 0x0003 (0x00D4 - 0x00D1)
class USFXActorFactoryRigidBody : public UActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.BioActorFactoryPhysicsActor
// 0x0000 (0x00D4 - 0x00D4)
class UBioActorFactoryPhysicsActor : public USFXActorFactoryRigidBody
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXAnimationMarker
// 0x001A (0x0288 - 0x026E)
class ASFXAnimationMarker : public AActor
{
public:
	struct FString                                     Text;                                             		// 0x0270 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UStaticMeshComponent*                        ZoneMeshComp;                                     		// 0x0280 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXArmourPiece
// 0x009C (0x00FC - 0x0060)
class USFXArmourPiece : public UObject
{
public:
	struct TArray<struct FName>                        HideBones;                                        		// 0x0060 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FVector                                     RelativeBoneLocation;                             		// 0x0070 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    RelativeBoneRotation;                             		// 0x007C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     RelativeBoneScale;                                		// 0x0088 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    Rotation;                                         		// 0x0094 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UObject*                                     Mesh;                                             		// 0x00A0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UObject*                                     DestroyedMesh;                                    		// 0x00A8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicalMaterial*                           PhysMaterialOverride;                             		// 0x00B0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UPhysicsAsset*                               PhysicsAsset;                                     		// 0x00B8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UPrimitiveComponent*                         AttachInstance;                                   		// 0x00C0 (0x0008) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	struct FName                                       AttachSocket;                                     		// 0x00C8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BoneName;                                         		// 0x00D0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             PS_Destruction;                                   		// 0x00D8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 DestructionSound;                                 		// 0x00E0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ArmourName;                                       		// 0x00E8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxHealth;                                        		// 0x00F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CurrentHealth;                                    		// 0x00F4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bMeshStartsHidden : 1;                            		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bStartsDetached : 1;                              		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bCanBeDamaged : 1;                                		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bNotifyOnHit : 1;                                 		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bPassThroughDamage : 1;                           		// 0x00F8 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void UpdateMorphWeights ( class USkeletalMeshComponent* SkelMeshComp, float NewWeight );
	void UpdateAppearance ( );
	void eventActivateEffects ( class AActor* oTarget );
	void DetachFromActor ( class AActor* oTarget, unsigned long bDestroyed, struct FTraceHitInfo* HitInfo );
	bool AttachToActor ( class AActor* oTarget );
};

// Class SFXGame.SFXAsyncAssetLoader
// 0x0038 (0x0098 - 0x0060)
class USFXAsyncAssetLoader : public UObject
{
public:
	struct FPointer                                    VfTable_FTickableObject;                          		// 0x0060 (0x0008) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct TArray<struct FSFXAsyncPackageRequest>      m_aPackageRequests;                               		// 0x0068 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct TArray<struct FSFXAsyncLoadGroupCallback>   m_OnGroupLoadedCallbacks;                         		// 0x0078 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnAsyncGroupLoaded__Delegate;                   		// 0x0088 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool GetAssetsForGroup ( struct FName nmAsyncGroupTag, struct TArray<class UObject*>* oAssets );
	void ClearAsyncGroup ( struct FName nmAsyncGroupTag );
	bool IsAsyncGroupLoaded ( struct FName nmAsyncGroupTag );
	void AsyncLoadAssets ( struct FName nmAsyncGroupTag, struct FScriptDelegate AsyncGroupLoaded, struct TArray<struct FSFXAsyncAssetRequest>* Assets );
	void OnAsyncGroupLoaded ( );
};

// Class SFXGame.SFXCombatZone
// 0x0010 (0x02C4 - 0x02B4)
class ASFXCombatZone : public AVolume
{
public:
	struct FGuid                                       CombatZoneGuid;                                   		// 0x02B4 (0x0010) [0x0000000000220003]              ( CPF_Edit | CPF_Const | CPF_EditConst )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXCustomReachSpec
// 0x0008 (0x00C4 - 0x00BC)
class USFXCustomReachSpec : public UAdvancedReachSpec
{
public:
	class APawn*                                       BlockingPawn;                                     		// 0x00BC (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXBoostReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXBoostReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXClimbWallReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXClimbWallReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXJumpDownReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXJumpDownReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXJumpReachSpec
// 0x0008 (0x00CC - 0x00C4)
class USFXJumpReachSpec : public USFXCustomReachSpec
{
public:
	float                                              MaxHeight;                                        		// 0x00C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MovePercentToReachMaxHeight;                      		// 0x00C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLadderReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXLadderReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLargeBoostReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXLargeBoostReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLargeClimbReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXLargeClimbReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLargeMantleReachSpec
// 0x0000 (0x00C4 - 0x00C4)
class USFXLargeMantleReachSpec : public USFXCustomReachSpec
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLeapReachSpecBase
// 0x0004 (0x00C8 - 0x00C4)
class USFXLeapReachSpecBase : public USFXCustomReachSpec
{
public:
	float                                              LeapHeight;                                       		// 0x00C4 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLeapReachSpecHumanoid
// 0x0000 (0x00C8 - 0x00C8)
class USFXLeapReachSpecHumanoid : public USFXLeapReachSpecBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXLeapReachSpecLarge
// 0x0000 (0x00C8 - 0x00C8)
class USFXLeapReachSpecLarge : public USFXLeapReachSpecBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXDamageType
// 0x006E (0x012E - 0x00C0)
class USFXDamageType : public UDamageType
{
public:
	struct TArray<struct FHitReactionSet>              HitReactions;                                     		// 0x00C0 (0x0010) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct FResistanceInfo                             Resistance;                                       		// 0x00D0 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UForceFeedbackWaveform*                      ShieldHitFFWaveform;                              		// 0x00DC (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class URvrClientEffectInterface*                   CE_DeathEffect;                                   		// 0x00E4 (0x0008) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_PlayerFrameBufferEffect;                       		// 0x00EC (0x0008) [0x0000000000000000]              
	class UWwiseEvent*                                 DeathSoundEffect;                                 		// 0x00F4 (0x0008) [0x0000000000000000]              
	float                                              WoundPct;                                         		// 0x00FC (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              DamageRadius;                                     		// 0x0100 (0x0004) [0x0000000000000000]              
	float                                              HeadGibChance;                                    		// 0x0104 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                DeathEffectPriority;                              		// 0x0108 (0x0004) [0x0000000000000000]              
	float                                              Range_Melee;                                      		// 0x010C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Range_Short;                                      		// 0x0110 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Range_Medium;                                     		// 0x0114 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Range_Long;                                       		// 0x0118 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FlinchChance;                                     		// 0x011C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FlinchDistance;                                   		// 0x0120 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                SourceDisplayName;                                		// 0x0124 (0x0004) [0x0000000000000000]              
	unsigned long                                      bSpawnWeaponImpacts : 1;                          		// 0x0128 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIgnoreShields : 1;                               		// 0x0128 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bPartBasedDamageDisabled : 1;                     		// 0x0128 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bHealthDamage : 1;                                		// 0x0128 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bDamagesFriends : 1;                              		// 0x0128 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bCanGibHead : 1;                                  		// 0x0128 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      bIsMelee : 1;                                     		// 0x0128 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      bCausesNormalizedDamage : 1;                      		// 0x0128 (0x0004) [0x0000000000000001] [0x00000080] ( CPF_Edit )
	unsigned long                                      bUsesDamageScaling : 1;                           		// 0x0128 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      bIgnoreDamageGating : 1;                          		// 0x0128 (0x0004) [0x0000000000000001] [0x00000200] ( CPF_Edit )
	unsigned long                                      bAlwaysPlayHitReact : 1;                          		// 0x0128 (0x0004) [0x0000000000000001] [0x00000400] ( CPF_Edit )
	unsigned long                                      bCriticalHit : 1;                                 		// 0x0128 (0x0004) [0x0000000000000001] [0x00000800] ( CPF_Edit )
	unsigned long                                      bMPKillDamage : 1;                                		// 0x0128 (0x0004) [0x0000000000000001] [0x00001000] ( CPF_Edit )
	unsigned long                                      bCausesRagdoll : 1;                               		// 0x0128 (0x0004) [0x0000000000000001] [0x00002000] ( CPF_Edit )
	unsigned long                                      bCausesRagdollOnDeath : 1;                        		// 0x0128 (0x0004) [0x0000000000000001] [0x00004000] ( CPF_Edit )
	unsigned long                                      bDisableAIControl : 1;                            		// 0x0128 (0x0004) [0x0000000000000001] [0x00008000] ( CPF_Edit )
	unsigned long                                      bImmediateDeath : 1;                              		// 0x0128 (0x0004) [0x0000000000000001] [0x00010000] ( CPF_Edit )
	unsigned long                                      bIgnoresCoverDirection : 1;                       		// 0x0128 (0x0004) [0x0000000000000001] [0x00020000] ( CPF_Edit )
	unsigned long                                      bNoShake : 1;                                     		// 0x0128 (0x0004) [0x0000000000000000] [0x00040000] 
	unsigned long                                      bCorpseDestroyedOnDeath : 1;                      		// 0x0128 (0x0004) [0x0000000000000002] [0x00080000] ( CPF_Const )
	unsigned char                                      FalloffType;                                      		// 0x012C (0x0001) [0x0000000000000000]              
	unsigned char                                      WoundDamage;                                      		// 0x012D (0x0001) [0x0000000000004001]              ( CPF_Edit | CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	float CalculateDamageMultiplier ( struct FDamageCalculationAlgorithm* DamageCalc );
	void ResetDamageCalc ( struct FDamageCalculationAlgorithm* DamageCalc );
	bool CanPlayDeathEffect ( class ABioPawn* Target, class AController* Killer );
};

// Class SFXGame.SFXDamageType_Suicide
// 0x0002 (0x0130 - 0x012E)
class USFXDamageType_Suicide : public USFXDamageType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGame.SFXGRI
// 0x008D (0x037D - 0x02F0)
class ASFXGRI : public AGameReplicationInfo
{
public:
	struct FScriptDelegate                             __GenericTimerCallback__Delegate;                 		// 0x02F0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      DifficultyHandlerClass;                           		// 0x0300 (0x0008) [0x0000000000000002]              ( CPF_Const )
	class UClass*                                      VocManagerClass;                                  		// 0x0308 (0x0008) [0x0000000000000000]              
	class ASFXObjectPool*                              ObjectPool;                                       		// 0x0310 (0x0008) [0x0000000000000000]              
	class ASFXPreAsyncWorkTicker*                      PreAsyncWorker;                                   		// 0x0318 (0x0008) [0x0000000000000000]              
	class ASFXDuringAsyncWorkTicker*                   DuringAsyncWorker;                                		// 0x0320 (0x0008) [0x0000000000000000]              
	class USFXGameConfig*                              gameconfig;                                       		// 0x0328 (0x0008) [0x0000000000000000]              
	class ASFXVocalizationManager*                     VocManager;                                       		// 0x0330 (0x0008) [0x0000000000000000]              
	class USFXMarkerModuleManager*                     MarkerModuleManager;                              		// 0x0338 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	class USFXDifficultyHandler*                       DifficultyHandler;                                		// 0x0340 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class ASFXWaveCoordinator*                         WaveCoordinator;                                  		// 0x0348 (0x0008) [0x0000000000000020]              ( CPF_Net )
	class URvrClientEffectManager*                     m_pClientEffectManager;                           		// 0x0350 (0x0008) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	class URvrClientEffectPool*                        m_pClientEffectPool;                              		// 0x0358 (0x0008) [0x0000000004400008]              ( CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline )
	float                                              StormStamina;                                     		// 0x0360 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              StormRegen;                                       		// 0x0364 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              StormStaminaNonCombat;                            		// 0x0368 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              StormRegenNonCombat;                              		// 0x036C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              HackCrouchCoverOffset;                            		// 0x0370 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              WaveDelay;                                        		// 0x0374 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      bCanSpawnHenchmen : 1;                            		// 0x0378 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bPlayerCanChangeSquad : 1;                        		// 0x0378 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bPauseForCommand : 1;                             		// 0x0378 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bAllowTimeDilation : 1;                           		// 0x0378 (0x0004) [0x0000000000000000] [0x00000008] 
